{
    "college": "NUI Galway",
    "course": "GY322 Agricultural Science",
    "code": "GY322",
    "title": "Agricultural Science",
    "course_type": "Undergraduate",
    "course_starts": "September",
    "fees": "7,408.00",
    "level": "Level 8",
    "award": "Bachelor of Science(Agricultural Science)",
    "duration": "4 years",
    "mode_of_study": "Full Time",
    "method_of_delivery": "Face-to-Face",
    "commencement_date": "September",
    "location": "Galway",
    "thumbnail_image_url": "",
    "website_url": "https://www.universityofgalway.ie/",
    "course_description": "The US $8 trillion agrifood sector is the largest contributor to economic development globally. In Ireland, the agrifood sector is a rapid-growth sector extensively providing food, employment and livelihoods.  The dynamic agrifood sector requires multidisciplinary skills to advance both agricultural productivity and sustainability, from production to consumption. This degree has a major focus on agricultural sustainability and innovation. Graduates will be equipped with practical multidisciplinary skills to pursue vibrant careers across all areas of agriculture and agrifood. To make a difference in the agrifood sector, you should choose this exciting new course.",
    "course_content": "YEAR ONE Key concepts in Agricultural Science and Agrifood Technology Biological and Chemical Sciences Sustainability and Business This year is taught through lectures, labbased practical classes, interactive online assessments and AgSci tutorials and seminars.  YEAR TWO Rural Environments Animal Nutrition Agribiochemicals Agribiosciences Sustainability & Management Food Chemistry Agrigeography and Geographical Information Systems The practical Fieldwork and Skills Development module is a particularly important part of Year 2.  YEAR THREE Agrisciences for Global Development Soil Sciences Agrigenetics Forestry Systems Organic Farming You will specialise further in your academic training and spend a semester on a work placement within a leading and dynamic agricultural or agrifood enterprise.  YEAR FOUR You will select from a range of tailored modules to provide you with the skills needed for your future career. These will support your Final Year Project Thesis, a 20 ECTS project within University of Galway research groups (e.g, of the Ryan Institute) or a research placement at Teagasc or other leading agri-institutions in Ireland and globally. The taught 4th year module options include:  Advanced Livestock Science Sustainable Grassland Systems Crop Science & Agronomy Crop Genetics Climate Change & Agriculture Agridevelopment Agriextension & Communications Agricultural Biotechnology Project & Financial Management & Structures Food Innovation Systems & Value Chains.",
    "minimum_entry_requirements": "",
    "video": "",
    "faculty_information_lecturer": "Cathal ODonoghue",
    "faculty_information__lecturer_image_url": "https://youtu.be/-Mts7f_mW8w",
    "faculty_information__id": 1,
    "job_opportunities_and_salary_expectations": "The University of Galway BSc Agricultural Science degree is designed to meet the demand from agrifood employers in Ireland and globally for graduates with the interdisciplinary skills and depth of knowledge of the agrifood sector that can effect positive change within the institutions and in the sector.   The top 1000 agrifood companies in Ireland are listed on: http://www.top1000. ie/industries/agribusiness. At the global level, agrifood companies feature very strongly in the Forbes 2000 list of the largest companies globally: https://www. forbes.com/global2000/#4cc0efed335d. In addition to careers in existing companies, graduates with interests in entrepreneurship and self-employment will be facilitated to pursue the establishment of their own enterprises. The University of Galway BSc Agricultural Science degree has extensive contacts with public sector and NGO institutions that can also provide excellent career pathways for our graduates.   Work Placement In Year Three, students spend a semester on a work placement within a leading and dynamic agricultural or agrifood enterprise.  Study Abroad The BSc Agricultural Science degree will encourage and facilitate study abroad opportunities for students as they arise and where they are high-quality and consistent with the mission and quality education outcomes mission of the BSc Agricultural Science degree at University of Galway.",
    "clubs_and_societies": "https://socs.nuigalway.ie/societies/",
    "course_reviews_and_testimonials": "",
    "map_info": "https://www.universityofgalway.ie/buildings/maps/",
    "students_accomodation_link": "https://www.universityofgalway.ie/student-life/accommodation/",
    "workshops": "https://libguides.library.nuigalway.ie/events"
  }
  {
    "college": "NUI Galway",
    "course": "GY408 Biomedical Engineering",
    "code": "GY408",
    "title": "Biomedical Engineering",
    "course_type": "Undergraduate",
    "course_starts": "September",
    "fees": "7,408.00",
    "level": "Level 8",
    "award": "Bachelor of Engineering (Biomedical)",
    "duration": "4 years",
    "mode_of_study": "Full Time",
    "method_of_delivery": "Face-to-Face",
    "commencement_date": "September",
    "location": "Galway",
    "thumbnail_image_url": "",
    "website_url": "https://www.universityofgalway.ie/",
    "course_description": "Biomedical Engineering is a relatively new branch of engineering that involves the use of cutting-edge technologies to help improve human healthcare. Biomedical engineers are involved in the design and creation of medical devices, implants such as stents, instruments and materials for clinical use. They also apply their engineering skills to problems in human biology and are at the forefront of developments in human medicine in the 21st century, enabling the medicial profession to diagnose and treat disease, and repair or replace damaged living tissue.  This degree programme was developed as a result of the need within the biomedical industry for highly skilled personnel. Locally based biomedical companies, of which there is a significant cluster, were involved in its design. It therefore remains highly relevant to the needs of industry while giving students a full training in engineering design principles and their application to human biology in an interdisciplinary environment. Related, relevant subjects that are covered over the course of the degree programme include biomedical instrumentation, tissue engineering and biomechanics.  If you want an interesting career that involves the application of engineering principles to medicine and biology, this may suit you. Biomedical engineers assist clinicians to analyse and solve problems in biology and medicine, therby helping to sustain or improve life. Both traditional and modern engineering principles and new technology are used. Biomedical engineers are also challenged to ensure that advances in technology keep pace with the advances in medicine and that the diagnostic, life-support or life-enhancing tools they create remain compatible with the human body.",
    "course_content": "At the School of Engineering we are focused on ensuring that you will be educated to the highest standards, and will have the necessary qualifications to avail of all of the professional opportunities presented to you, both in Ireland and across the world. You will be enrolled on an integrated five year programme; a Bachelor of Engineering (BE) (four years, Level 8) + a Master of Engineering (ME) (one year, Level 9). Students on the BE+ME pathway will avail of advanced engineering modules, a substantial research and development project, and a work placement.  Upon successful completion of the five years of study, graduates will have the educational qualifications required for progression to Chartered Engineer. Full information on the optional 5th Year is provided at www.nuigalway.ie/courses/taught-postgraduate-courses/biomedical-engineering-me.html",
    "minimum_entry_requirements": "Entry Requirements Minimum Grade H5 in two subjects and passes in four other subjects at O6/H7 Level in the Leaving Certificate, including Irish, English, Mathematics, a laboratory science subject (i.e., Chemistry, Physics, Biology, Physics with Chemistry (joint), Agricultural Science or Computer Science) or Technology, and any two other subjects recognised for entry purposes.    Additional Requirements Students must obtain a minimum of Grade H4 in the Higher Level Leaving Certificate paper in Mathematics or, alternatively places available (which may vary in number year to year) may be allocated to those candidates who have achieved the points requirement for the programme that year, who satisfy the general requirements for Matriculation in the College of Engineering and Informatics and who attain a Pass in the Engineering Maths Qualifying Examination. The places available will be allocated in strict order of merit based points attained in the Leaving Certificate. Due to capacity constraints, not all candidates who achieve a pass in the examination may receive an offer.",
    "video": "",
    "faculty_information_lecturer": "Aisling Rooney",
    "faculty_information__lecturer_image_url": "https://youtu.be/-Mts7f_mW8w",
    "faculty_information__id": 2,
    "job_opportunities_and_salary_expectations": "Career Opportunities Biomedical Engineering offers a variety of career opportunities in such areas as private industry, universities, hospitals, research facilities, education and medical institutes, in teaching and in working for government regulatory agencies. With eight of the world's top ten biomedical companies based in Ireland - many of which are in Galway - there are good prospects for employment nationally while remaining open to opportunities overseas",
    "clubs_and_societies": "https://socs.nuigalway.ie/societies/",
    "course_reviews_and_testimonials": "",
    "map_info": "https://www.universityofgalway.ie/buildings/maps/",
    "students_accomodation_link": "https://www.universityofgalway.ie/student-life/accommodation/",
    "workshops": "https://libguides.library.nuigalway.ie/events"
  }
  {
    "college": "NUI Galway",
    "course": "GY303 Biomedical Science",
    "code": "GY303",
    "title": "Biomedical Science",
    "course_type": "Undergraduate",
    "course_starts": "September",
    "fees": "7,408.00",
    "level": "Level 8",
    "award": "Bachelor of Science (Biomedical Science)",
    "duration": "4 years",
    "mode_of_study": "Full Time",
    "method_of_delivery": "Face-to-Face",
    "commencement_date": "September",
    "location": "Galway",
    "thumbnail_image_url": "",
    "website_url": "https://www.universityofgalway.ie/",
    "course_description": "What is Biomedical Science?  Biomedical Science is the study of Life Science subjects related to human health and disease. Students will learn about the structure and function of the human body from the level of organs and tissues to the molecular level, as well as how drugs are used to treat disease. You will major in one of the following biomedical science subjects: Anatomy, Biochemistry, Pharmacology or Physiology.  Why should I study Biomedical Science?  This degree is dedicated to producing top quality graduates who have achieved academic excellence. The programme promotes small-group learning throughout the course. This informal interaction with academic staff allows students to get to know their lecturers and helps promote a range of skills such as Communication, Leadership, Teamwork and Creativity. This course also offers the unique opportunity to undertake a research project in both third and fourth year.  International Links  Students have the opportunity to apply to spend one semester of third year in the United States (e.g. University of California) or in Asia (e.g. Hong Kong University of Science and Technology).",
    "course_content": "YEAR ONE Biology Chemistry Physics Biomedical Science (including science communication, essays, debates) YEAR TWO Three pathways from:  Anatomy, Biochemistry, Pharmacology or Physiology (two subjects for both semesters and one other for Semester I only) Biomedical Science (including seminars and community knowledge initiative projects) YEAR THREE One major pathway from:  Anatomy, Biochemistry, Pharmacology or Physiology (including mini research project) Biostatistics Biomedical Science (Research Methods and Applications) Electives - options include Developmental Biology and Bioinformatics YEAR FOUR  Continue with one major pathway from:  Anatomy, Biochemistry, Pharmacology or Physiology Major research project",
    "minimum_entry_requirements": "Entry Requirements Minimum Grade H5 in two subjects and passes in four other subjects at O6/H7 level in the Leaving Certificate, including Irish, English, Mathematics, a laboratory science subject (i.e. Chemistry, Physics, Biology, Physics with Chemistry (joint) or Agricultural Science) and any two other subjects recognised for entry purposes.   Additional Requirements Students must satisfy the Garda/police vetting requirements",
    "video": "",
    "faculty_information_lecturer": "Dr Helen Dodson",
    "faculty_information__lecturer_image_url": "https://youtu.be/-Mts7f_mW8w",
    "faculty_information__id": 3,
    "job_opportunities_and_salary_expectations": "Career Opportunities Graduates from this program will find employment in the pharmaceutical (e.g. Allergan), diagnostics (e.g. Abbott) and medical devices (e.g. Medtronic, Boston Scientific) industries. Other graduates will go on to careers in research, academia and many areas of health sciences and health care.",
    "clubs_and_societies": "https://socs.nuigalway.ie/societies/",
    "course_reviews_and_testimonials": "",
    "map_info": "https://www.universityofgalway.ie/buildings/maps/",
    "students_accomodation_link": "https://www.universityofgalway.ie/student-life/accommodation/",
    "workshops": "https://libguides.library.nuigalway.ie/events"
  }
  {
    "college": "NUI Galway",
    "course": "GY304 Biotechnology",
    "code": "GY304",
    "title": "Biotechnology",
    "course_type": "Undergraduate",
    "course_starts": "September",
    "fees": "7,408.00",
    "level": "Level 8",
    "award": "Bachelor of Science (Biotechnology)",
    "duration": "4 years",
    "mode_of_study": "Full Time",
    "method_of_delivery": "Face-to-Face",
    "commencement_date": "September",
    "location": "Galway",
    "thumbnail_image_url": "",
    "website_url": "https://www.universityofgalway.ie/",
    "course_description": "Biotechnology is the application of biology for the benefit of humanity and the environment. It harnesses living organisms to provide foods and medicines, and for tasks such as cleaning toxic waste or detecting harmful substances. Biotechnology has roots in food and agriculture, using yeast to make beer and bread, and lactic acid bacteria to make cheese. Modern technologies such as genetic engineering make biotechnology a major part of Irelands economic future in biopharmaceuticals, biomedicine, agriculture, the food industry and the environment.  Our BSc Biotechnology is a science-focused and closely mentored course with strong career opportunities and an international outlook. Alongside core knowledge of modern biology, the BSc Biotechnology degree provides tailored training in communications, business and languages skills. Students complete individual projects in research laboratories on campus in their fourth year, and have the opportunity to undertake placements in industry in Ireland, or research laboratories across Europe.",
    "course_content": "The BSc Biotechnology combines a strong foundation in science with a broad awareness of how this can be applied and skills to translate this knowledge.  In first year students study core biology, chemistry and maths principles alongside unique biotechnology and language modules with an emphasis on practical activities.  In second year students study molecular cell biology, microbiology and chemistry while continuing to develop their biotechnology and language skills.  In third year students continue with molecular cell biology and microbiology plus pharmacology and their language. In semester 2 there is an opportunity for a 3-6 month placement in Irish industry or a research laboratory in continental Europe. An on-campus alternative course emphasising genetics and biochemistry is also available.  In final year students take modules in biochemistry, a business course including business development project, as well as completing semester-long individually mentored literature review and research project.",
    "minimum_entry_requirements": "Entry Requirements Minimum Grade H5 in two subjects and passes in four other subjects at O6/H7 level in the Leaving Certificate, including Irish, English, a third anguage, Mathematics, a laboratory science subject (i.e, Chemistry, Physics, Biology, Physics with Chemistry (joint), Computer Science or Agricultural Science) and any one other subject recognised for entry purposes.   Additional Requirements Minimum O2 or H6 in a modern European language other than Irish or English.",
    "video": "",
    "faculty_information_lecturer": "Dr Stephen Rea",
    "faculty_information__lecturer_image_url": "https://youtu.be/-Mts7f_mW8w",
    "faculty_information__id": 4,
    "job_opportunities_and_salary_expectations": "Career Opportunities Our graduates are equipped with a wide range of capabilities and practical experience, including business and language skills to complement their knowledge of biology.  Biotechnologists find rewarding careers across Irelands smart economyincluding biopharmaceuticals, diagnostics, healthcare, and the environment, as well as in academic and industry research. Their science knowledge and skills also opens doors to areas such as management, education, medicine and marketing.",
    "clubs_and_societies": "https://socs.nuigalway.ie/societies/",
    "course_reviews_and_testimonials": "",
    "map_info": "https://www.universityofgalway.ie/buildings/maps/",
    "students_accomodation_link": "https://www.universityofgalway.ie/student-life/accommodation/",
    "workshops": "https://libguides.library.nuigalway.ie/events"
  }
  {
    "college": "NUI Galway",
    "course": "GY402 Civil Engineering",
    "code": "GY402",
    "title": "Civil Engineering",
    "course_type": "Undergraduate",
    "course_starts": "September",
    "fees": "7,408.00",
    "level": "Level 8",
    "award": "Bachelor of Engineering (Civil)",
    "duration": "4 years",
    "mode_of_study": "Full Time",
    "method_of_delivery": "Face-to-Face",
    "commencement_date": "September",
    "location": "Galway",
    "thumbnail_image_url": "",
    "website_url": "https://www.universityofgalway.ie/",
    "course_description": "Civil Engineering is concerned with the planning, design, construction and maintenance of the built environment. It encompasses minor and major structures, ranging from drainage systems, houses, commercial buildings, roads and bridges to multi-story buildings and water and wastewater treatment facilities. The work of civil engineers is most visible in the structures in which we live and work. Their contribution is also seen in transportation systems that we use on a daily basis such as subways, motorways, railways, airports and harbours. They are also involved in the design, construction and operation of complex water supply and sanitation systems for our ever-growing cities. In such projects and more generally, they perform a critical public and environmental health function as well.  The Civil Engineering degree programme sets out to develop the scientific, technical, organisational, IT and communication skills needed for a satisfying and rewarding career as a Civil Engineer.  Civil Engineers work in rapidly changing and challenging areas using traditional and new materials and techniques, and increasingly incorporating IT solutions at design and construction stage. You could be involved in schemes from design to management stage through to completion in what are often highly complex projects. Therefore, the profession combines creative skills with an aptitude for mathematics and technical subjects. At the most challenging end of the profession, where the management of large projects is involved, a high degree of administration skills are also required.  If you think you might enjoy developing and constructing bridges, tunnels, roads, railways, major building or other infrastructural projects, you should consider Civil Engineering. The skills you will learn will give you opportunities for work worldwide wherever development is taking place; not least in the fast-growing economies of the BRIC countries (Brazil, Russia, India and China).",
    "course_content": "Year 5 optional At the School of Engineering we are focused on ensuring that you will be educated to the highest standards, and will have the necessary qualifications to avail of all of the professional opportunities presented to you, both in Ireland and across the world. You will be enrolled on an integrated five year programme; a Bachelor of Engineering (BE) (four years, Level 8) + a Master of Engineering (ME) (one year, Level 9). Students on the BE+ME pathway will avail of advanced engineering modules, a substantial research and development project, and a work placement.  Upon successful completion of the five years of study, graduates will have the educational qualifications required for progression to Chartered Engineer. Full information on the optional 5th Year is provided at www.nuigalway.ie/courses/taught-postgraduate-courses/civil-engineering.html",
    "minimum_entry_requirements": "Entry Requirements Minimum Grade H5 in two subjects and passes in four other subjects at O6/H7 Level in the Leaving Certificate, including Irish, English, Mathematics, a aboratory science subject (i.e., Chemistry, Physics, Biology, Physics with Chemistry (joint), Agricultural Science or Computer Science) or Technology, and any two other subjects recognised for entry purposes. Additional requirements: Minimum H4 in Mathematics or, alternatively, obtain a pass in the Engineering Maths Qualifying Exam (held in the University).   Additional Requirements Students must obtain a minimum of Grade H4 in the Higher Level Leaving Certificate paper in Mathematics or, alternatively places available (which may vary in number year to year) may be allocated to those candidates who have achieved the points requirement for the programme that year, who satisfy the general requirements for Matriculation in the College of Engineering and Informatics and who attain a Pass in the Engineering Maths Qualifying Examination. The places available will be allocated in strict order of merit based points attained in the Leaving Certificate. Due to capacity constraints, not all candidates who achieve a pass in the examination may receive an offer.  For A-levels: A minimum of Grade C in Mathematics is required",
    "video": "",
    "faculty_information_lecturer": "Serena Lawless",
    "faculty_information__lecturer_image_url": "https://youtu.be/-Mts7f_mW8w",
    "faculty_information__id": 5,
    "job_opportunities_and_salary_expectations": "Career Opportunities Graduates from this programme will find employment in:  Consulting/Contracting (dealing e.g. with Structures, Transportation, Public Health, Offshore and Coastal Engineering) Government Departments Semi-State Organisations Local Authorities",
    "clubs_and_societies": "https://socs.nuigalway.ie/societies/",
    "course_reviews_and_testimonials": "",
    "map_info": "https://www.universityofgalway.ie/buildings/maps/",
    "students_accomodation_link": "https://www.universityofgalway.ie/student-life/accommodation/",
    "workshops": "https://libguides.library.nuigalway.ie/events"
  }
  {
    "college": "NUI Galway",
    "course": "GY350 Computer Science and Information Technology",
    "code": "GY350",
    "title": "Computer Science and Information Technology",
    "course_type": "Undergraduate",
    "course_starts": "September",
    "fees": "7,408.00",
    "level": "Level 8",
    "award": "Bachelor of Science (Honours) Computer Science and Information Technology",
    "duration": "4 years",
    "mode_of_study": "Full Time",
    "method_of_delivery": "Face-to-Face",
    "commencement_date": "September",
    "location": "Galway",
    "thumbnail_image_url": "",
    "website_url": "https://www.universityofgalway.ie/",
    "course_description": "We depend on electronic devices, such as computers and mobile phones, computer software and networks to store, process, transmit, retrieve and manipulate information. Students will cover the technology used in these devices and will focus on the development of the software applications that make these devices useful.  The programme has a flexible course structure, where students can choose to study a range of Next-Generation Technology areas including: Digital Media and Games, Enterprise Informatics, Energy Informatics, Computational Mathematics, Scientific Computing and Medical/ Bio-informatics.  These core subjects provide a solid theoretical and applied background in Computer Science and Information Technology.  Work Placement As part of this four-year course, students will undertake an eight month (January - August) off-campus work placement in an industrial setting following completion of their thrid year of study. In the event that no external placement is available, students will be given projects on campus. This work experience programme gives students an opportunity to work on projects relevant to their study and significantly improves their chances of obtaining employment after graduation. Read more about Engineering work placements.",
    "course_content": "Optional MA160: Mathematics - 10 Credits - Semester 1 Optional MA190: Mathematics (Honours) - 10 Credits - Semester 1 Required CT1114: Web Development - 5 Credits - Semester 1 Required CT1112: Professional Skills I - 5 Credits - Semester 1 Required CT101: Computing Systems - 10 Credits - Semester 1 Required CT102: Algorithms & Information Systems - 10 Credits - Semester 1 Required EE130: Fundamentals of Electrical & Electronic Engineering I - 5 Credits - Semester 1 Required CT103: Programming - 10 Credits - Semester 1 Required PH150: Introduction to Physics - 5 Credits - Semester 2 Year 2 (60 Credits) Optional MA2286: Differential Forms - 5 Credits - Semester 3 Required MA284: Discrete Mathematics - 5 Credits - Semester 3 Required CT216: Software Engineering I - 10 Credits - Semester 3 Required CT2106: Object-Oriented Programming - 5 Credits - Semester 3 Required CT230: Database Systems I - 5 Credits - Semester 3 Required CT213: Computer Systems & Organization - 5 Credits - Semester 3 Required ST2001: Statistics for Data Science 1 - 5 Credits - Semester 3 Optional MA283: Linear Algebra - 5 Credits - Semester 4 Optional CT248: Introduction to Modelling - 5 Credits - Semester 4 Optional MA203: Linear Algebra - 5 Credits - Semester 4 Optional CT255: Next Generation Technologies II - 5 Credits - Semester 4 Optional MA2287: Complex Analysis - 5 Credits - Semester 4 Required CT2108: Networks and Data Communications 1 - 5 Credits - Semester 4 Required CT2109: Object Oriented Programming: Data Structures and Algorithms - 5 Credits - Semester 4 Year 3 (60 Credits) Optional ST235: Probability - 5 Credits - Semester 5 Optional CT318: Human Computer Interaction - 5 Credits - Semester 5 Optional CT331: Programming Paradigms - 5 Credits - Semester 5 Optional MA341: Metric Spaces - 5 Credits - Semester 5 Optional MA385: Numerical Analysis I - 5 Credits - Semester 5 Optional MA3343: Groups - 5 Credits - Semester 5 Optional CT3536: Games Programming - 5 Credits - Semester 5 Required CT3532: Database Systems 2 - 5 Credits - Semester 5 Required CT3531: Networks and Data Communications 2 - 5 Credits - Semester 5 Required CT5106: Software Engineering 2 - 5 Credits - Semester 5 Required CT326: Programming III - 10 Credits - Semester 5 Required CT3534: Professional Experience Programme in Information Technology - 10 Credits - Semester 5 Required CT3533: Organisational Innovation - 5 Credits - Semester 5 Required CT3112: Professional Skills - 5 Credits - Semester 6 Year 4 (60 Credits) Optional MA416: Rings - 5 Credits - Semester 7 Optional MA436: Final Year Project - 10 Credits - Semester 7 Optional CT404: Graphics & Image Process - 5 Credits - Semester 7 Optional CT561: Systems Modelling and Simulation - 5 Credits - Semester 7 Optional CT413: Final Year Project - 10 Credits - Semester 7 Optional MA490: Measure Theory - 5 Credits - Semester 7 Optional MA3101: Euclidean and Non-Euclidean Geometry - 5 Credits - Semester 7 Optional CT5119: Functional Programming for Data Analytics - 5 Credits - Semester 7 Optional CT4100: Information Retrieval - 5 Credits - Semester 7 Required CT436: Advanced Professional Skills - 5 Credits - Semester 7 Required CT421: Artificial Intelligence - 5 Credits - Semester 7 Required CT417: Software Engineering III - 5 Credits - Semester 7 Required CT4101: Machine Learning - 5 Credits - Semester 7 Optional CS4423: Networks - 5 Credits - Semester 8 Optional MA3491: Fields and Applications - 5 Credits - Semester 8 Optional MA342: Topology - 5 Credits - Semester 8 Optional MA236: Statistical Inference - 5 Credits - Semester 8 Optional CT437: Computer Security and Forensic Computing - 5 Credits - Semester 8 Optional MA4344: Advanced Group Theory - 5 Credits - Semester 8 Optional CS402: Cryptography - 5 Credits - Semester 8 Required CT420: Real Time Systems - 5 Credits - Semester 8 Required CT414: Distributed Systems & Co Operative Computing - 5 Credits - Semester 8",
    "minimum_entry_requirements": "Entry Requirements Minimum Grade H5 in two subjects and passes in four other subjects at O6/H7 Level in the Leaving Certificate, including Irish, English, Mathematics, and any three other subjects recognised for entry purposes. Students must also obtain a minimum Grade O2 or H6 in Mathematics or alternatively obtain a pass in the Engineering Maths Qualifying Examination (held in the University).   Additional Requirements Students must obtain a minimum Grade O2 or H6 in Mathematics or alternatively places available (which may vary in number year to year) may be allocated to those candidates who have achieved the points requirement for the programme that year, who satisfy the general requirements for Matriculation in the College of Engineering and Informatics and who attain a Pass in the Engineering Maths Qualifying Examination. The places available will be allocated in strict order of merit based points attained in the Leaving Certificate. Due to capacity constraints, not all candidates who achieve a pass in the examination may receive an offer.  For A-Levels a Grade D in A-Level Mathematics or Grade B in O-Level Mathematics is required.",
    "video": "",
    "faculty_information_lecturer": "School of Computer Science, College of Science and Engineering",
    "faculty_information__lecturer_image_url": "https://youtu.be/-Mts7f_mW8w",
    "faculty_information__id": 6,
    "job_opportunities_and_salary_expectations": "Career Opportunities Graduates of the BSc in Computer Science & Information Technology are highly skilled and are equipped to take on employment as professional engineers, designers and consultants in a range of organisations, specialising in areas such as software design and development, digital media and games, IT consultancy, telecommunications and medical informatics. Career prospects for IT/computing graduates are very strong in Ireland and throughout the world. The governments Expert Group on Future Skill Needs has highlighted a shortfall in the number of IT/computing graduates as the number of students studying IT/computing is not adequate to meet the demands in virtually every sector.",
    "clubs_and_societies": "https://socs.nuigalway.ie/societies/",
    "course_reviews_and_testimonials": "",
    "map_info": "https://www.universityofgalway.ie/buildings/maps/",
    "students_accomodation_link": "https://www.universityofgalway.ie/student-life/accommodation/",
    "workshops": "https://libguides.library.nuigalway.ie/events"
  }
  {
    "college": "NUI Galway",
    "course": "GY314 Earth and Ocean Sciences",
    "code": "GY314",
    "title": "Earth and Ocean Sciences",
    "course_type": "Undergraduate",
    "course_starts": "September",
    "fees": "7,408.00",
    "level": "Level 8",
    "award": "Bachelor of Science (Earth and Ocean Sciences)",
    "duration": "4 years",
    "mode_of_study": "Full Time",
    "method_of_delivery": "Face-to-Face",
    "commencement_date": "September",
    "location": "Galway",
    "thumbnail_image_url": "",
    "website_url": "https://www.universityofgalway.ie/",
    "course_description": "Earth & Ocean Sciences, a degree programme unique in Ireland, integrates geology and oceanography to better understand how the Earth works, how its different systems interact (from the upper atmosphere down to the deep crust) and how it is able to support life. The course exposes graduates to a global career market, from sustainable sourcing of raw materials, through renewable energy, to environmental assessment and the regulation and monitoring of industries. We aim to train the scientists who can investigate issues of global change, and the course aligns with the UN's sustainability goals.",
    "course_content": "YEAR ONE Chemistry Physics Biology Plus one of the following: Mathematical Studies Mathematics Applied Mathematics  YEAR TWO The Earth: From Core to Crust Introduction to Field Skills Introduction to Ocean Science Plus one pathway from the following: Applied Mathematics Botany and Plant Science Chemistry Mathematical Studies Mathematics Microbiology Physics and Applied Physics Plant and AgriBiosciences Zoology Plus electives from a range of science modules  YEAR THREE Field Skills Training Ocean Dynamics Aquatic Geochemistry Introduction to Applied Field Hydrology Sediments and the Sedimentary Record Geological Structures and Maps The Crystalline Crust Palaeontology and Evolution Environmental and Marine Geophysical Remote Sensing Minerals and Rocks under the Microscope Plus electives from a range of science modules  YEAR FOUR  Final Year Project Advanced Fieldskills Global Change Earth and Ocean Science (EOS) advanced modules",
    "minimum_entry_requirements": "Entry Requirements Minimum Grade H5 in two subjects and passes in four other subjects at O6/H7 level in the Leaving Certificate, including Irish, English, Mathematics, a laboratory science subject (i.e. Chemistry, Physics, Biology, Physics with Chemistry (joint) or Agricultural Science) and any two other subjects recognised for entry purposes.",
    "video": "",
    "faculty_information_lecturer": "Tiernan Henry",
    "faculty_information__lecturer_image_url": "https://youtu.be/-Mts7f_mW8w",
    "faculty_information__id": 7,
    "job_opportunities_and_salary_expectations": "Career Opportunities Graduates can purse a range of career opportunities in diverse industries, including energy, raw materials, conservation, education and tourism. EOS graduates are working in all of these areas, in Ireland or overseas. The geoscience sector employs more than 25,000 people in Ireland and generates more than 3 billion per year for the Irish economy.",
    "clubs_and_societies": "https://socs.nuigalway.ie/societies/",
    "course_reviews_and_testimonials": "",
    "map_info": "https://www.universityofgalway.ie/buildings/maps/",
    "students_accomodation_link": "https://www.universityofgalway.ie/student-life/accommodation/",
    "workshops": "https://libguides.library.nuigalway.ie/events"
  }
  {
    "college": "NUI Galway",
    "course": "GY414 Electrical and Electronic Engineering",
    "code": "GY414",
    "title": "Electrical and Electronic Engineering",
    "course_type": "Undergraduate",
    "course_starts": "September",
    "fees": "7,408.00",
    "level": "Level 8",
    "award": "Bachelor of Engineering (Electrical and Electronic)",
    "duration": "4 years",
    "mode_of_study": "Full Time",
    "method_of_delivery": "Face-to-Face",
    "commencement_date": "September",
    "location": "Galway",
    "thumbnail_image_url": "",
    "website_url": "https://www.universityofgalway.ie/",
    "course_description": "Electrical and Electronic Engineering involves developing technologies required for our future needs in such areas as communication, electrical energy, transport, healthcare and entertainment. Electrical and Electronic Engineers are involved in advances in medical technology, mobile phones, wireless communications, electrical power systems, renewable energy, electric vehicles, e-commerce and the internet-of-things. This degree programme provides students with a broad range of skills relating to all aspects of the design of electrical and electronic systems and devices. It combines coursework in different aspects of electrical and electronic engineering, as well as individual and group project work, where students design and build innovative electrical and electronic systems.  This programme provides a solid technological base from which a career in electrical and electronic engineering can be launched, along with the basic skills needed to sustain professional development throughout a graduate career. As it combines coursework, laboratory classes and projects in different aspects of electrical and electronic engineering, the programme will give graduates the knowledge and skills needed to design and develop innovation technologies for a wide range of industry sectors. It incorporates the design and development of devices, circuits and systems that are used in a wide range of high-tech products and so it will appeal to students who like to understand how technology works, and who have an interest in electrical or electronic circuits. Students who enjoy science, and particularly physics, are usually attracted to it.",
    "course_content": "Year 1: Years 1 covers the basics of maths and science as they apply in engineering, as well as an introduction to engineering, including engineering graphics and computing.   Year 2: There are some additional maths modules in year 2, but the main focus is on introductory modules on electrical and electronic engineering, including circuit analysis, analog and digital electronics, electromagnetics and programming.   Years 3 & 4: You make your decision at the start of year three whether to remain on the five-year integrated BE+ME programme or to exit with a BE at the end of year four. In years three and four, training in electrical and electronic circuit design continues with advanced modules in analogue and digital systems, electrical engineering and applied software. There is a greater focus on application areas such as telecommunications, microelectronics (system-on-chip), electrical power/energy, and control systems (automation). All modules include practical classes to provide you experience of hardware/software tools for circuit design and testing. These skills are developed further in project work. Modules on professional skills such as project management are also included",
    "minimum_entry_requirements": "Entry Requirements Minimum Grade H5 in two subjects and passes in four other subjects at O6/H7 Level in the Leaving Certificate, including Irish, English, Mathematics, a laboratory science subject (i.e., Chemistry, Physics, Biology, Physics with Chemistry (joint), Agricultural Scienc or Computer Science) or Technology, and any two other subjects recognised for entry purposes.  Additional requirements: Minimum H4 in Mathematics or, alternatively, obtain a pass in the Engineering Maths Qualifying Exam (held in the University).   Additional Requirements Students must obtain a minimum of Grade H4 in the Higher Level Leaving Certificate paper in Mathematics or, alternatively places available (which may vary in number year to year) may be allocated to those candidates who have achieved the points requirement for the programme that year, who satisfy the general requirements for Matriculation in the College of Engineering and Informatics and who attain a Pass in the Engineering Maths Qualifying Examination. The places available will be allocated in strict order of merit based points attained in the Leaving Certificate. Due to capacity constraints, not all candidates who achieve a pass in the examination may receive an offer.  For A -Levels: A minimum of Grade C in Mathematics is required.",
    "video": "",
    "faculty_information_lecturer": "Mary Costello",
    "faculty_information__lecturer_image_url": "https://youtu.be/-Mts7f_mW8w",
    "faculty_information__id": 8,
    "job_opportunities_and_salary_expectations": "Career Opportunities Graduates of this programme are in high demand in a wide range of industries, including automotive electronics, microelectronics, electrical engineering, renewable energy, automation, medical devices, and telecommunication. Electrical & Electronic engineers work in a variety of roles including product design and development, field testing, applications engineering, electrical consultancy and project management. This course provides you with the skills needed to design electrical and electronic products that are ever more intelligent, energy efficient, connected and safe.",
    "clubs_and_societies": "https://socs.nuigalway.ie/societies/",
    "course_reviews_and_testimonials": "",
    "map_info": "https://www.universityofgalway.ie/buildings/maps/",
    "students_accomodation_link": "https://www.universityofgalway.ie/student-life/accommodation/",
    "workshops": "https://libguides.library.nuigalway.ie/events"
  }
  {
    "college": "NUI Galway",
    "course": "GY406 Electronic and Computer",
    "code": "GY406",
    "title": "Electronic and Computer",
    "course_type": "Undergraduate",
    "course_starts": "September",
    "fees": "7,408.00",
    "level": "Level 8",
    "award": "Bachelor of Engineering (Electronic and Computer)",
    "duration": "4 years",
    "mode_of_study": "Full Time",
    "method_of_delivery": "Face-to-Face",
    "commencement_date": "September",
    "location": "Galway",
    "thumbnail_image_url": "",
    "website_url": "https://www.universityofgalway.ie/",
    "course_description": "Electronic and Computer Engineering is a course that aims to integrate two separate engineering fields to meet the joint demands made by the electronics and computer industries in today's world. This programme combines coursework in different aspects of both fields over four years, with an emphasis on the design of computing systems. Electronics and computers, and their joint applications, are playing an ever-increasing role in our lives as Information Communications Technology (ICT), with everything from consumer goods to space shuttles using electronic hardware (circuits) and computer software integrated together. The increased use of ICT in every aspect of our lives ensures the continued relevance of this area of engineering.  Companies who design integrated electronics and computer systems require engineers who possess the software skills to complement traditional electronic hardware skills. The Electronic and Computer Engineering degree programme has been developed in response to these industry demands to develop students' hardware and software engineering skills in an integrated way and the analytical powers to apply them jointly.  Graduates of this course are ideally placed to pursue their specialism in ICT, which has wide applicability both nationally, with many indigenous technology companies and the multinational sector, and internationally. With the exponential development of ICT technologies worldwide, graduates will be at the forefront of people being employed in this area.",
    "course_content": "Year 1 Covers the basics of mathematics and science as they apply in engineering, as well as an introduction to engineering, including engineering graphics and computing.  Year 2 Year 2 covers theoretical and practical foundation in electronics and computing including programming languages, circuit analysis, digital and analogue electronics, sensors and instrumentation, communication technologies and electromagnetics.  Year 3&4 You make your decision at the start of year three whether to remain on the five-year integrated BE+ME programme or to exit with a BE at the end of year four. Year 3 continues with further training in design of digital and analogue systems, programming languages and database systems, communications and signals and systems. Year 4 covers a range of advanced topics in electronic and computer engineering including real time systems, machine learning, integrated circuit design, telecommunications software, digital signal processing and distributing systems and computing. All modules include practical classes to provide you experience of hardware/software tools for circuit design and testing. These skills are developed further in project work. Modules on professional skills such as project management are also included",
    "minimum_entry_requirements": "Entry Requirements Minimum Grade H5 in two subjects and passes in four other subjects at O6/H7 Level in the Leaving Certificate, including Irish, English, Mathematics, a laboratory science subject (i.e., Chemistry, Physics, Biology, Physics with Chemistry (joint), Agricultural Science or Computer Science) or Technology, and any two other subjects recognised for entry purposes. Additional requirements: Minimum H4 in Mathematics or, alternatively, obtain a pass in the Engineering Maths Qualifying Exam (held in the University).   Additional Requirements Students must obtain a minimum of Grade H4 in the Higher Level Leaving Certificate paper in Mathematics or, or, alternatively places available (which may vary in number year to year) may be allocated to those candidates who have achieved the points requirement for the programme that year, who satisfy the general requirements for Matriculation in the College of Engineering and Informatics and who attain a Pass in the Engineering Maths Qualifying Examination. The places available will be allocated in strict order of merit based points attained in the Leaving Certificate. Due to capacity constraints, not all candidates who achieve a pass in the examination may receive an offer.  For A-Levels: A minimum of Grade C in Mathematics is required",
    "video": "",
    "faculty_information_lecturer": "Mary Costello",
    "faculty_information__lecturer_image_url": "https://youtu.be/-Mts7f_mW8w",
    "faculty_information__id": 9,
    "job_opportunities_and_salary_expectations": "Career Opportunities Completing the University of Galway/Engineers Ireland-accredited BE degree in Electronic and Computer Engineering offers a passport to national and international career opportunities in the wide and diverse range of industries, utilities and other organizations that use electronic and computer engineering expertise. This includes such areas as electronic system design, medical systems, healthcare, networking and distributed computing, telecommunications, automotive electronics, industrial automation, consumer electronics, broadcasting, management information systems and energy management systems. ICT expertise offers you the prospect of doing research or working in industry in these interesting, exciting and challenging areas.",
    "clubs_and_societies": "https://socs.nuigalway.ie/societies/",
    "course_reviews_and_testimonials": "",
    "map_info": "https://www.universityofgalway.ie/buildings/maps/",
    "students_accomodation_link": "https://www.universityofgalway.ie/student-life/accommodation/",
    "workshops": "https://libguides.library.nuigalway.ie/events"
  }
  {
    "college": "NUI Galway",
    "course": "GY413 Energy Systems",
    "code": "GY413",
    "title": "Energy Systems",
    "course_type": "Undergraduate",
    "course_starts": "September",
    "fees": "7,408.00",
    "level": "Level 8",
    "award": "Bachelor of Engineering (Energy Systems)",
    "duration": "4 years",
    "mode_of_study": "Full Time",
    "method_of_delivery": "Face-to-Face",
    "commencement_date": "September",
    "location": "Galway",
    "thumbnail_image_url": "",
    "website_url": "https://www.universityofgalway.ie/",
    "course_description": "Why choose Energy Systems Engineering? Energy Systems Engineers are the people who are transforming the way we use, store and produce energy, meeting the worlds growing energy needs while avoiding climate and biodiversity breakdown, and increasing our energy security. Energy Systems Engineers can be found in companies that design and build giant wind turbines, in the control room of our power grid, rolling out electric vehicle infrastructure, deploying green hydrogen infrastructure and designing zero-carbon buildings A recent survey shows that 94% Energy Systems Engineering graduates are in full-time employment or study less than six months after graduation",
    "course_content": "Year 1 Engineering Calculus Engineering Mechanics Engineering Chemistry Engineering Graphics Engineering Computing 1 Fundamentals of Engineering Engineering Mathematical Methods Engineering Design Engineering Computing II Engineering Physics Year 2 Mathematics and Applied Mathematics I Engineering Statistics Thermodynamics & Fluid Mechanics Electronic Instrumentation and Sensors Principles of Building Community Engaged Building Project Strength of Materials Mathematics and Applied Mathematics II Electrical Circuits and Systems Introduction to Modelling Theory of Machines and CADD Year 3 Energy Systems Electrical Design Project Design of Energy Systems for the Built Environment Linear Control Systems Thermodynamics and Heat Transfer Electromechanical Power Conversion Fluid Dynamics Sustainable Energy Power Electronics Microprocessor Systems Engineering Combustion Science and Engineering Turbomachines and Advanced Fluid Dynamics Energy in Buildings Year 4 Mechanical Analysis and Design Design of Sustainable Environmental Systems 1 Energy Conversion CFD module Object Oriented Programming Power Systems 8-month Paid Work Placement Project Management for Engineers Professional Skills",
    "minimum_entry_requirements": "Entry Requirements Minimum Grade H5 in two subjects and passes in four other subjects at O6/H7 Level in the Leaving Certificate, including Irish, English, Mathematics, a laboratory science subject (i.e., Chemistry, Physics, Biology, Physics with Chemistry (joint), Agricultural Science or Computer Science) or Technology, and any two other subjects recognised for entry purposes. Additional requirements: Minimum H4 in Mathematics or, alternatively, obtain a pass in the Engineering Maths Qualifying Exam (held in the University).   Additional Requirements Students must obtain a minimum of Grade H4 in the Higher Level Leaving Certificate paper in Mathematics or, alternatively places available (which may vary in number year to year) may be allocated to those candidates who have achieved the points requirement for the programme that year, who satisfy the general requirements for Matriculation in the College of Engineering and Informatics and who attain a Pass in the Engineering Maths Qualifying Examination. The places available will be allocated in strict order of merit based points attained in the Leaving Certificate. Due to capacity constraints, not all candidates who achieve a pass in the examination may receive an offer.  For A-Levels: A minimum of Grade C in Mathematics is required.",
    "video": "",
    "faculty_information_lecturer": "Serena Lawless",
    "faculty_information__lecturer_image_url": "https://youtu.be/-Mts7f_mW8w",
    "faculty_information__id": 10,
    "job_opportunities_and_salary_expectations": "Career Opportunities Why choose Energy Systems Engineering? Energy Systems Engineers are the people who are transforming the way we use, store and produce energy, meeting the worlds growing energy needs while avoiding climate and biodiversity breakdown, and increasing our energy security. Energy Systems Engineers can be found in companies that design and build giant wind turbines, in the control room of our power grid, rolling out electric vehicle infrastructure, deploying green hydrogen infrastructure and designing zero-carbon buildings A recent survey shows that 94% Energy Systems Engineering graduates are in full-time employment or study less than six months after graduation It addresses humanitys most challenging question: How can society expand access to energy, which drives all human activity, in an secure way, while avoiding climate and biodiversity breakdown? Multidisciplinary modules cover technologies like wind, solar, hydrogen, ocean, hydro, bioenergy and nuclear; smart grids, buildings and cities; sustainable water systems; national energy systems; climate science; research methods; and energy economics, policy and law. This programme is accredited by Engineers Ireland for Chartered Engineer status (if combined with an accredited bachelors degree).",
    "clubs_and_societies": "https://socs.nuigalway.ie/societies/",
    "course_reviews_and_testimonials": "",
    "map_info": "https://www.universityofgalway.ie/buildings/maps/",
    "students_accomodation_link": "https://www.universityofgalway.ie/student-life/accommodation/",
    "workshops": "https://libguides.library.nuigalway.ie/events"
  }
  {
    "college": "NUI Galway",
    "course": "GY401 Engineering (Undenominated)",
    "code": "GY401",
    "title": "Engineering (Undenominated)",
    "course_type": "Undergraduate",
    "course_starts": "September",
    "fees": "7,408.00",
    "level": "Level 8",
    "award": "Bachelor of Engineering (Undenominated)",
    "duration": "1 years",
    "mode_of_study": "Full Time",
    "method_of_delivery": "Face-to-Face",
    "commencement_date": "September",
    "location": "Galway",
    "thumbnail_image_url": "",
    "website_url": "https://www.universityofgalway.ie/",
    "course_description": "Engineering is a wide area, covering such fields as civil, mechanics, electronics and computer technology. This course offers you the option of studying engineering in a general way for a year before going on to specialise in your chosen field in year two. It has been designed to help you make your choice about what professional engineering qualification you wish to study for by giving you a year to study the basic concepts and fundamentals of engineering. Therefore, it will help you to make an informed choice about what you wish to specialise in by enabling you to find out where your aptitude and interests lie. Undenominated Engineering will always stand to students as a foundation course. On successful completion of their first year exams, students will be able to transfer to the second year of one of the programmes within the College of Science and Engineering. Prospective students should note that they will be at no academic disadvantage having chosen first year Undenominated Engineering: they will not have to complete an additional year of study (which is a common misconception about this programme!). If anything, students will be able to make an informed decision about their area of study having completed Undenominated Engineering.",
    "course_content": "Year 1 (60 Credits) Required EI140: Fundamentals of Engineering - 10 Credits - Semester 1 Required CH140: Engineering Chemistry - 5 Credits - Semester 1 Required EI160: Engineering Graphics - 5 Credits - Semester 1 Required MP120: Engineering Mechanics - 5 Credits - Semester 1 Required MA140: Engineering Calculus - 5 Credits - Semester 1 Required CT1110: Engineering Computing I - 5 Credits - Semester 1 Required PH140: Engineering Physics - 5 Credits - Semester 2 Required MM140: Engineering Mathematical Methods - 5 Credits - Semester 2 Required EI150: Engineering Design - 10 Credits - Semester 2 Required CT1111: Engineering Computing II - 5 Credits - Semester 2 Year 2  Choose to follow one of the following denominated programmes:  Civil Engineering Electrical and Electronic Engineering Mechanical Engineering Electronic and Computer Engineering Biomedical Engineering Computer Science and Information Technology Energy Systems Engineering Project & Construction Management Year 3 Follow chosen programme of Engineering Year 4 Follow chosen programme of Engineering",
    "minimum_entry_requirements": "Entry Requirements Minimum Grade H5 in two subjects and passes in four other subjects at O6/H7 Level in the Leaving Certificate, including Irish, English, Mathematics, a laboratory science subject (i.e., Chemistry, Physics, Biology, Physics with Chemistry (joint), Agricultural Science or Computer Science) or Technology, and any two other subjects recognised for entry purposes. Additional requirements: Minimum H4 in Mathematics or, alternatively, obtain a pass in the Engineering Maths Qualifying Exam (held in the University).   Additional Requirements Students must obtain a minimum of Grade H4 in the Higher Level Leaving Certificate paper in Mathematics or, alternatively places available (which may vary in number year to year) may be allocated to those candidates who have achieved the points requirement for the programme that year, who satisfy the general requirements for Matriculation in the College of Engineering and Informatics and who attain a Pass in the Engineering Maths Qualifying Examination. The places available will be allocated in strict order of merit based points attained in the Leaving Certificate. Due to capacity constraints, not all candidates who achieve a pass in the examination may receive an offer.  For A-levels: A minimum of Grade C in A-level Mathematics is required.",
    "video": "",
    "faculty_information_lecturer": "Prof Mark Healy",
    "faculty_information__lecturer_image_url": "https://youtu.be/-Mts7f_mW8w",
    "faculty_information__id": 11,
    "job_opportunities_and_salary_expectations": "Career Opportunities Depending on students' choice of engineering discipline, there is a wide range of career opportunities for engineers, in industry, universities, hospitals, medical institutes, government regulatory agencies, research, software companies, financial services, and much more.",
    "clubs_and_societies": "https://socs.nuigalway.ie/societies/",
    "course_reviews_and_testimonials": "",
    "map_info": "https://www.universityofgalway.ie/buildings/maps/",
    "students_accomodation_link": "https://www.universityofgalway.ie/student-life/accommodation/",
    "workshops": "https://libguides.library.nuigalway.ie/events"
  }
  {
    "college": "NUI Galway",
    "course": "GY313 Environmental Health and Safety",
    "code": "GY313",
    "title": "Environmental Health and Safety",
    "course_type": "Undergraduate",
    "course_starts": "September",
    "fees": "7,408.00",
    "level": "Level 8",
    "award": "Bachelor of Science (Environmental Health and Safety)",
    "duration": "4 years",
    "mode_of_study": "Full Time",
    "method_of_delivery": "Face-to-Face",
    "commencement_date": "September",
    "location": "Galway",
    "thumbnail_image_url": "",
    "website_url": "https://www.universityofgalway.ie/",
    "course_description": "The?BSc in Environmental Health and Safety is a multidisciplinary programme that examines the relationship between workplace factors and human health, safety and well-being. Students study subjects including the basic sciences, health sciences, engineering, law and regulatory affairs among others. The programme is designed to meet the needs of industry and provides students with a high-quality qualification in the multidisciplinary area of Environmental Health and Safety. It enables students to work across all sectors as occupational and environmental health & safety professionals. There is continuous demand for such graduates across all sectors.   This programme offers the opportunity to experience life as a health and safety professional as all students complete a seven-month work placement in industry during third year. This placement allows students to further develop their knowledge and apply their technical skills within the workplace.   This programme has been accredited by the Institution of Occupational Safety and Health (IOSH). Students can access IOSH Student Membership for the duration of their studies and, on successful completion, they will meet the academic requirements for Graduate (Grad IOSH) membership. Graduate membership is the gateway to Chartered status. As IOSH is the only organisation in the world that offers Chartered membership to health and safety practitioners, this can help you achieve the highest professional standards and gain international recognition",
    "course_content": "YEAR ONE Biology Mathematics Chemistry/Physics Communications and Computing Introduction to Environmental Health and Safety Introduction to Law  YEAR TWO Human Gross Anatomy Health and Safety Physiology Introduction to Biostatistics Health and Safety Law Physics of the Environment Analytical and Environmental Chemistry Microbes and the Environment Fundamentals of Operations Engineering Safety System Design Environmental Health and Safety Practice  YEAR THREE Occupational Health and Well-Being Exposure Science Research Methods for Occupational Health and Safety Environmental Health and Safety Law Project Management Ergonomic Design of the Workplace Safety and Construction Quality Systems Introduction to Regulatory Affairs in Manufacturing  YEAR FOUR  Health and the Work Environment Case Studies Information Systems Ergonomics Professional Experience Report Human Reliability Health and Safety Project",
    "minimum_entry_requirements": "Entry Requirements Minimum Grade H5 in two subjects and passes in four other subjects at O6/H7 level in the Leaving Certificate, including Irish, English, Mathematics, a laboratory science subject (i.e. Chemistry, Physics, Biology, Physics with Chemistry (joint) or Agricultural Science) and any two other subjects recognised for entry purposes",
    "video": "",
    "faculty_information_lecturer": "Dr. Marie Coggins",
    "faculty_information__lecturer_image_url": "https://youtu.be/-Mts7f_mW8w",
    "faculty_information__id": 12,
    "job_opportunities_and_salary_expectations": "Career Opportunities  There is continuous demand for occupational health and safety graduates as all organisations have legal duties and regulatory requirements with which they must comply. The course provides students with skills necessary to undertake occupational, environmental and quality roles in industry.  The programme has an excellent employment record. Graduates of the programme are mainly employed as Environmental Health and Safety Professionals, with some choosing careers in Regulatory Affairs and Quality Management.  The main employment sectors include manufacturing, consultancy, construction and energy, medical devices and pharmaceutical industries, as well as regulatory and public bodies.  International Accreditation  This programme is accredited by the Institution of Occupational Safety and Health (IOSH), and graduates have the opportunity to work nationally and internationally.",
    "clubs_and_societies": "https://socs.nuigalway.ie/societies/",
    "course_reviews_and_testimonials": "",
    "map_info": "https://www.universityofgalway.ie/buildings/maps/",
    "students_accomodation_link": "https://www.universityofgalway.ie/student-life/accommodation/",
    "workshops": "https://libguides.library.nuigalway.ie/events"
  }
  {
    "college": "NUI Galway",
    "course": "GY308 Environmental Science",
    "code": "GY308",
    "title": "Environmental Science",
    "course_type": "Undergraduate",
    "course_starts": "September",
    "fees": "7,408.00",
    "level": "Level 8",
    "award": "Bachelor of Science (Environmental Science)",
    "duration": "4 years",
    "mode_of_study": "Full Time",
    "method_of_delivery": "Face-to-Face",
    "commencement_date": "September",
    "location": "Galway",
    "thumbnail_image_url": "",
    "website_url": "https://www.universityofgalway.ie/",
    "course_description": "Environmental Science is an interdisciplinary study which examines the interaction between humans and the environment, with specific reference to the effects of modern technological advances.  Today, the necessity to understand our environment has never been more urgent and the need for environmental scientists to deal with increasingly complex issues is growing. The course provides a thorough grounding in the basic sciences in the first year, followed by the application of this knowledge to current environmental problems in the later years. While studying a broad range of subjects, students are also given the opportunity to specialise in topics of their choice.",
    "course_content": "YEAR ONE Biology Hot Topics in Environmental Science Introduction to Law Introduction to Statistical Data and Probability With either: Chemistry Physics or Chemistry/Physics Introduction to Psychology I and II Introduction to Irish Habitats  YEAR TWO Environmental Modules Botany and Plant Science Modules Earth and Ocean Sciences Modules Microbiology Modules Zoology Modules Environmental Legislation  YEAR THREE Nature Conservation and Habitat Management Field Course with Environmental Skills Habitat Management Planning Legislation for Environmental Scientists Environmental Microbiology Microbial Genomics Plant Resources and Ecosystems Introduction to Biostatistics Plus four electives from a wide range of modules  YEAR FOUR Environmental Impact Assessment Environmental Science Seminars Advanced Field Course in Environmental Science Final Year Project Plus four electives from a wide range of modules",
    "minimum_entry_requirements": "Entry Requirements Minimum Grade H5 in two subjects and passes in four other subjects at O6/H7 level in the Leaving Certificate, including Irish, English, Mathematics, a laboratory science subject (i.e, Chemistry, Physics, Biology, Physics with Chemistry (joint), Computer Science or Agricultural Science) and any two other subjects recognised for entry purposes.",
    "video": "",
    "faculty_information_lecturer": "Dr Mike Gormally",
    "faculty_information__lecturer_image_url": "https://youtu.be/-Mts7f_mW8w",
    "faculty_information__id": 13,
    "job_opportunities_and_salary_expectations": "Career Opportunities Graduates of the programme have worked with such government bodies as the Environmental Protection Agency, Geological Survey of Ireland, the National Parks and Wildlife Service, Teagasc, the Regional Fisheries Boards, the National Biodiversity Records Centre and Waterways Ireland, as well as for local authorities, as environmental consultants and for Rural Environment Protection Scheme Planning Agencies. Opportunities also exist in the private sector and working as researchers.",
    "clubs_and_societies": "https://socs.nuigalway.ie/societies/",
    "course_reviews_and_testimonials": "",
    "map_info": "https://www.universityofgalway.ie/buildings/maps/",
    "students_accomodation_link": "https://www.universityofgalway.ie/student-life/accommodation/",
    "workshops": "https://libguides.library.nuigalway.ie/events"
  }
  {
    "college": "NUI Galway",
    "course": "GY309 Financial Mathematics and Economics",
    "code": "GY309",
    "title": "Financial Mathematics and Economics",
    "course_type": "Undergraduate",
    "course_starts": "September",
    "fees": "7,408.00",
    "level": "Level 8",
    "award": "Bachelor of Science (Financial Mathematics and Economics)",
    "duration": "4 years",
    "mode_of_study": "Full Time",
    "method_of_delivery": "Face-to-Face",
    "commencement_date": "September",
    "location": "Galway",
    "thumbnail_image_url": "",
    "website_url": "https://www.universityofgalway.ie/",
    "course_description": "The BSc in Financial Mathematics and Economics (BSc in FME) programme is a four-year degree programme consisting of courses in mathematics, economics, statistics/probability, applied mathematics, accounting and business finance, and computer science. The programmes aim is to equip students with expertise in quantitative subjects, with a particular focus on financial economics, actuarial mathematics and statistics. There is a high demand from financial institutions for well-qualified students with quantitative skills, and in an expanding market, highly numerate professionals are being sought, particularly in the areas of insurance, investment and finance. Typically in such employment, you would be predicting the long-term financial consequences of current and past decisions, taking account of various risk factors, and designing solutions to problems that involve financial risk or uncertainty.  The degree should appeal to people who enjoy mathematics and are interested in studying economics and other subjects in the financial area. (Please note that you do not have to study economics for the Leaving Certificate to be admitted to this course.) This degree has an advantage over other programmes, including specialised actuarial programmes, as it is broad and suits students not yet ready to specialise. The course is administered jointly by the College of Science and Engineering and the College of Business, Public Policy and Law. The entry requirements of either college may be applied, according to whichever is more advantageous to the applicant.",
    "course_content": "YEAR ONE  Mathematics Computer Science Economics Mathematics of Finance Statistical Methods and Probability Models Mathematical Methods I Financial Accounting  YEAR TWO Differential Forms Intermediate Macroeconomics Random Variables Mathematical Methods I Intermediate Microeconomics Linear Algebra Introduction to Financial Economics Programming for Science and Finance Discrete Mathematics Mathematical Methods 11 Statistical Inference Complex Analysis  YEAR THREE  Applied Regression Models Groups Microeconomics and Public Policy Actuarial Mathematics - Life Contingencies 1, pricing & reserving Money and Banking Metric Spaces Economics of Financial Markets Macroeconomics and Public Policy Non-Linear Systems Business Finance 2 Mathematical Modelling Topology  YEAR FOUR Actuarial Mathematics - Life Contingencies II Numerical Analysis Measure Theory Final Year Project Actuarial Mathematics - Life Contingencies 1, pricing & reserving Derivatives and Risk Management Economics electives Networks Statistical Modelling Differential Equations with Financial Derivatives",
    "minimum_entry_requirements": "Entry Requirements Minimum Grade H5 in two subjects and passes in four other subjects at O6/H7 level in the Leaving Certificate, including Irish, English, Mathematics, a third language or a laboratory science subject (i.e. Chemistry, Physics, Biology, Physics with Chemistry (joint), Computer Science or Agricultural Science) and any two other subjects recognised for entry purposes.    A H5 or O1 in Mathematics is required.  Additional Requirements This programme is an inter-college programme of the College of Science and Engineering and the College of Arts, Social Sciences and Celtic Studies. The entry requirements of either College may be applied, whichever is the more advantageous to the applicant.",
    "video": "",
    "faculty_information_lecturer": "Dr. Michael Hayes",
    "faculty_information__lecturer_image_url": "https://youtu.be/-Mts7f_mW8w",
    "faculty_information__id": 14,
    "job_opportunities_and_salary_expectations": "Career Opportunities There are excellent employment opportunities for graduates. The demand from employers for well-qualified students with knowledge of how financial markets operate and how to use quantitative techniques to make informed investment decisions is substantial. The employment prospects from this degree programme are excellent, with challenging and financially rewarding opportunities in many different areas. These include:  Financial services opportunities for graduates exist right across the financial services sector, in investment, corporate and private banking, in currency trading, in credit risk and in management of hedge funds. Some of the worlds leading financial firms have hired our graduates, including Goldman Sachs, JP Morgan, Merrill Lynch and Credit Suisse.  Actuarial profession graduates can embark on a career as an actuary, working primarily in pensions, life insurance and investments. Some of our graduates in recent years have gone on to complete postgraduate actuarial studies and other graduates have gone directly to positions as trainee actuaries.  Actuarial Exemptions  Other areas opportunities for our graduates exist in government departments and other public sector bodies, where they play key roles on issues affecting the national economy. In recent years, graduates have been hired by the Department of Finance, the Central Bank of Ireland, the Bank of England and the National Treasury Management Agency (NTMA). Moreover, because of their strong numeracy skills, graduates have also secured employment in a wide variety of different areas, for example, as economists, in accountancy, tax and law, in management consultancy and even as a sports odds compiler.",
    "clubs_and_societies": "https://socs.nuigalway.ie/societies/",
    "course_reviews_and_testimonials": "",
    "map_info": "https://www.universityofgalway.ie/buildings/maps/",
    "students_accomodation_link": "https://www.universityofgalway.ie/student-life/accommodation/",
    "workshops": "https://libguides.library.nuigalway.ie/events"
  }
  {
    "college": "NUI Galway",
    "course": "GY321 Genetics and Genomics",
    "code": "GY321",
    "title": "Genetics and Genomics",
    "course_type": "Undergraduate",
    "course_starts": "September",
    "fees": "7,408.00",
    "level": "Level 8",
    "award": "Bachelor of Science (Genetics and Genomics)",
    "duration": "4 years",
    "mode_of_study": "Full Time",
    "method_of_delivery": "Face-to-Face",
    "commencement_date": "September",
    "location": "Galway",
    "thumbnail_image_url": "",
    "website_url": "https://www.universityofgalway.ie/",
    "course_description": "Genetics and Genomics is an exciting area of science involving the study and use of DNA based data in the life sciences. Genetics is the study of how DNA is the blueprint for functionality in every cell and is also the code that passes information from one generation to the next. New sequencing technologies can now generate vast quantities of data from DNA. Genomics is the study of these data to make important discoveries in areas such as medicine, agriculture, evolution, the environment and biotechnology.",
    "course_content": "Graduates will be uniquely trained to integrate knowledge and skills from the biological sciences with mathematical, computational and data analytic skills. This multi-disciplinary course covers a range of biological, mathematical and computer science topics:  Medicine: the genetic basis of rare and common human diseases and how genomics uncovers genes that contribute to illness. Agri-bioscience: the genetic and biological origins of agriculture; food security and sustainable development. Microbiology: microbial genetics and key medical and environmental impacts of microorganisms. Evolution: evolutionary biology, including natural selection and the genetic mechanisms that shape evolution. Informatics:  computer programming and mathematical and algorithmic methods to solve problems in molecular genetics. The final year project will allow students to apply their knowledge in a research laboratory.  Students will benefit from group learning in a small class size, and will graduate with a broad range of skills including communication, teamwork, critical thinking and problem solving. These skills are called transferable because they will transfer and be useful in a broad range of careers post-graduation.  Your Course Year by Year YEAR ONE   Biology Chemistry: Molecular Science Mathematics (Honours level) Computer Science Introduction to Genetics & Genomics Biomedical Genomics: Research and Communication  YEAR TWO  Genetics, Medicine & Disease Molecular & Cellular Biology Protein Structure & Function Plant & Agribiosciences Microbiology Evolution Mathematics (Mathematical Molecular Biology, Statistics in Data Science) Biomedical Genomics: Seminars and Essays  YEAR THREE  Molecular & Cellular Biology Microbial Genomics Evolutionary Biology Human Genetics Plant and Agricultural Genetics Bioinformatics Genomic Analysis Research & Career Development Skills Plus Electives: Developmental Biology, Applied Statistics, Programming, Mathematical Molecular Biology  YEAR FOUR  Research Project Literature Review Advanced Chromosome Biology Molecular & Cellular Biology Biotechnology Plant Genetics & Systems Biology Current Topics in Biosciences Medical Genomics & Bioethics Plus Electives: Machine Learning and Data Mining, Information Management, Probabilistic Models for Molecular Biology, Microbial Gene Regulation",
    "minimum_entry_requirements": "Entry Requirements Minimum Grade H5 in two subjects and passes in four additional subjects at O6/H7 level in the Leaving Certificate, including Irish, English, a laboratory science subject (i.e. Chemistry, Physics, Biology, Physics with Chemistry (joint),Computer Science or Agricultural Science) and any two other subjects recognised for entry purposes.   Additional Requirements Minimum grade H5 or O1 in Mathematics.",
    "video": "",
    "faculty_information_lecturer": "Dr Derek Morris",
    "faculty_information__lecturer_image_url": "https://youtu.be/-Mts7f_mW8w",
    "faculty_information__id": 15,
    "job_opportunities_and_salary_expectations": "Career Opportunities There is growing demand for individuals that have both an in-depth understanding of genetics and the numerical and computer skills required to investigate and interpret genomic data. This will offer our graduates opportunities in genomic and life science companies, biotechnology and pharmaceutical industries, forensics and clinical diagnostics, biomedical devices and therapeutics, public health and epidemiology, agricultural and environmental sectors, as well as the information technology sector.  Work Placement Students have the opportunity to apply for summer research studentships (e.g., from the Wellcome Trust and Health Research Board) to support eight week paid internships in university-based research laboratories in the summer between 3rd and 4th Year. This is an excellent opportunity for students to experience a research environment and learn new skills that will be useful when completing their final year research project.",
    "clubs_and_societies": "https://socs.nuigalway.ie/societies/",
    "course_reviews_and_testimonials": "",
    "map_info": "https://www.universityofgalway.ie/buildings/maps/",
    "students_accomodation_link": "https://www.universityofgalway.ie/student-life/accommodation/",
    "workshops": "https://libguides.library.nuigalway.ie/events"
  }
  {
    "college": "NUI Galway",
    "course": "GY310 Marine Science",
    "code": "GY310",
    "title": "Marine Science",
    "course_type": "Undergraduate",
    "course_starts": "September",
    "fees": "7,408.00",
    "level": "Level 8",
    "award": "Bachelor of Science (Marine Science)",
    "duration": "4 years",
    "mode_of_study": "Full Time",
    "method_of_delivery": "Face-to-Face",
    "commencement_date": "September",
    "location": "Galway",
    "thumbnail_image_url": "",
    "website_url": "https://www.universityofgalway.ie/",
    "course_description": "Marine Science encompasses the study of marine life and environments, how they are formed and evolve, and how they are affected by human activity. Topics covered in this programme include marine biology, earth science, chemistry and experimental physics, mathematics, statistics, oceanography, meteorology, botany, geology and microbiology.  The degree in Marine Science is a four-year degree leading to a BSc (Hons). At the end of the degree, you will have improved your knowledge about the marine environment and will have developed your thinking and practical and personal skills, enabling you to undergo further academic training in a wide variety of scientific disciplines or begin your career. Marine Science is a broad area and the programme aims to help you find what speciality you prefer to study by introducing the subject in a general way at first and allowing you to follow your particular interests later on.  At present, University of Galway is the only Irish university offering this degree programme and it now has the highest concentration of marine scientists of any institution in Ireland. Research ranges from fundamental understanding of the marine ecosystem to very applied activities involving close co-operation with industry and state agencies. The 3,000 square metre Martin Ryan Marine Science Institute houses most of the teaching and research activity in Marine Sciences at the university. MRI Carna carries out applied research in Carna, County Galway.",
    "course_content": "YEAR ONE This year is a foundation year to ensure that all students have the background needed for more advanced material. The staff teaching science subjects (Biology, Chemistry, Physics) will not assume that all the class have studied the subject in their school-leaving qualification. There are additional supports to help students like SUMS - the mathematics support centre at University of Galway  YEAR TWO Students are able to select from a range of appropriate science modules, alongside core marine material in modules like Fundamentals in Aquatic Plant Science, Introduction to Ocean Science and Invertebrate Zoology (many invertebrate groups are exclusively or mostly marine)  YEAR THREE This year continues the balance of core (e.g., Marine Habitat) and optional modules. This is also the year where it is possible to participate in an Erasmus exchange or apply for one of the College of Science and Engineerings study abroad opportunities).  YEAR FOUR The 4th year includes a major research project carried out with an academic supervisor. This helps develop deeper knowledge alongside skills in project management and data evaluation. Also in this year there is a module (Field Skills in Marine Science) structured around experience on one of the Marine Institutes research vessels. There is a free choice of optional modules, including a module in ocean politics.",
    "minimum_entry_requirements": "Entry Requirements Minimum Grade H5 in two subjects and passes in four other subjects at O6/H7 level in the Leaving Certificate, including Irish, English, Mathematics, a laboratory science subject (i.e, Chemistry, Physics, Biology, Physics with Chemistry (joint), Computer Science or Agricultural Science) and any two other subjects recognised for entry purposes.",
    "video": "",
    "faculty_information_lecturer": "Professor Mark Johnson",
    "faculty_information__lecturer_image_url": "https://youtu.be/-Mts7f_mW8w",
    "faculty_information__id": 16,
    "job_opportunities_and_salary_expectations": "Career Opportunities The oceans are fascinating and full of things to discover, and it has always been good advice to study something you are interested in. At the same time, we are in the middle of what has been called a blue acceleration. This is a rapid expansion across the world in marine-related sectors like marine protected areas, offshore renewables, aquaculture, and shipping. All these sectors need marine scientists working in non-governmental organizations, government agencies and private companies. The types of jobs may include data collection in the field, data analysis, laboratory analyses, report writing, fund-raising, education, or policy advice. There are well over 100 small companies in the Irish marine sector, most of which you will not have heard of due to their size, but some of these companies will expand as the blue acceleration proceeds. There will also be a continual need for marine scientists at the Marine Institute and in other government agencies and departments.  We have graduates working in marine-related roles in the Irish public and private sector. Our graduates have also gone on to study and work overseas. A final thing to remember: Although you will always have studied marine science, the skills from a degree are transferrable, allowing access to many different types of graduate careers.",
    "clubs_and_societies": "https://socs.nuigalway.ie/societies/",
    "course_reviews_and_testimonials": "",
    "map_info": "https://www.universityofgalway.ie/buildings/maps/",
    "students_accomodation_link": "https://www.universityofgalway.ie/student-life/accommodation/",
    "workshops": "https://libguides.library.nuigalway.ie/events"
  }
  {
    "college": "NUI Galway",
    "course": "GY319 Mathematical Science",
    "code": "GY319",
    "title": "Mathematical Science",
    "course_type": "Undergraduate",
    "course_starts": "September",
    "fees": "7,408.00",
    "level": "Level 8",
    "award": "Bachelor of Science (Mathematical Science)",
    "duration": "4 years",
    "mode_of_study": "Full Time",
    "method_of_delivery": "Face-to-Face",
    "commencement_date": "September",
    "location": "Galway",
    "thumbnail_image_url": "",
    "website_url": "https://www.universityofgalway.ie/",
    "course_description": "This honours degree programme provides students with a solid foundation in Mathematical Science, encompassing all aspects of mathematics and its applications. Students will have the opportunity to specialise in particular areas, for example in mathematics, applied mathematics, financial mathematics, computer science, statistics and bioinformatics.",
    "course_content": "YEAR ONE Applied Mathematics Mathematics Probability Models and Statistical Methods Introduction to Programming One of: Biology, Chemistry, Physics Mathematical Science Workshop Series  YEAR TWO Curriculum core consists of components from the following modules/pathways: Linear Algebra Discrete Mathematics Differential Forms Complex Analysis Probability Statistical Inference Mechanics Mathematical Methods Up to one-third of the second-year curriculum can be selected from a list of additional options, some offered from within the school and some available within other science disciplines, subject to firstyear prerequisites  YEAR THREE AND FOUR Selection of specialised modules from chosen areas of the mathematical sciences. Students can view the range of possibilites on the course website. Final-year project in subject area of your choice.",
    "minimum_entry_requirements": "Entry Requirements Minimum Grade H5 in two subjects and passes in four other subjects at O6/H7 level in the Leaving Certificate including Irish, English, Mathematics and three other subjects recognised for entry purposes. Additional requirements: Minimum of H5 or O1 in Mathematics.   Additional Requirements Grade C in A-Level Mathematics or Grade A at O-Level",
    "video": "",
    "faculty_information_lecturer": "Professor Dane Flannery",
    "faculty_information__lecturer_image_url": "https://youtu.be/-Mts7f_mW8w",
    "faculty_information__id": 17,
    "job_opportunities_and_salary_expectations": "Career Opportunities The reasoning skills and problem-solving abilities of Mathematical Science graduates are highly valued and the career opportunities are diverse, both in the public and private sectors. Many graduates are employed in the financial and actuarial services, while others are working in the IT industry, particularly in programming and software development. Others work in the pharmaceutical industry, doing clinical research, and in secondary and tertiary education, and the civil service.",
    "clubs_and_societies": "https://socs.nuigalway.ie/societies/",
    "course_reviews_and_testimonials": "",
    "map_info": "https://www.universityofgalway.ie/buildings/maps/",
    "students_accomodation_link": "https://www.universityofgalway.ie/student-life/accommodation/",
    "workshops": "https://libguides.library.nuigalway.ie/events"
  }
  {
    "college": "NUI Galway",
    "course": "GY405 Mechanical Engineering",
    "code": "GY405",
    "title": "Mechanical Engineering",
    "course_type": "Undergraduate",
    "course_starts": "September",
    "fees": "7,408.00",
    "level": "Level 8",
    "award": "Bachelor of Engineering (Mechanical)",
    "duration": "4 years",
    "mode_of_study": "Full Time",
    "method_of_delivery": "Face-to-Face",
    "commencement_date": "September",
    "location": "Galway",
    "thumbnail_image_url": "",
    "website_url": "https://www.universityofgalway.ie/",
    "course_description": "Mechanical Engineering is a subject concerned with the design and manufacture of parts and systems that make up the range of machinery and equipment you see around you, from a can opener to a jet aircraft. Mechanical engineers design the tools and processes necessary to create all man-made products, and are often involved from conceiving of an idea right through to seeing it as a finished product ready for its commercial application. They design everything you think of as a device or machine. Devices used in engines, the components used in transportation, power conversion equipment, like the steam and wind turbines used in modern electric power plants, and processing equipment used in oil and gas rigs all come within the remit of the mechanical engineer.  If you think you have or can develop the skills and knowledge to understand the requirements for designing a moving device or machine for the environment it will be used in as well as understand how it will best be manufactured, then you may make a good mechanical engineer. This degree programme is designed to provide graduates with the skills to face the challenge for newer, better, faster, more reliable, more versatile, longer-lasting and more environmentally friendly products and processes. These skills need also to be complemented by the managerial and personal skills needed to interact with teams on joint projects.    Learning about Mechanical Engineering will help you to develop your creative side, a part of your thinking that will enable you to design a new product or system and the analytical skills to make it a reality. You will also learn about the value of the teamwork skills that go into the successful production of most devices and processes used in today's world. These are valuable skills that will be useful in other areas of your life also.",
    "course_content": "Year 1 (60 Credits) Required MA140: Engineering Calculus - 5 Credits - Semester 1 Required MP120: Engineering Mechanics - 5 Credits - Semester 1 Required CT1110: Engineering Computing I - 5 Credits - Semester 1 Required CH140: Engineering Chemistry - 5 Credits - Semester 1 Required EI140: Fundamentals of Engineering - 10 Credits - Semester 1 Required EI160: Engineering Graphics - 5 Credits - Semester 1 Required CT1111: Engineering Computing II - 5 Credits - Semester 2 Required MM140: Engineering Mathematical Methods - 5 Credits - Semester 2 Required PH140: Engineering Physics - 5 Credits - Semester 2 Required EI150: Engineering Design - 10 Credits - Semester 2 Year 2 (60 Credits) Required MA2101: Mathematics and Applied Mathematics I - 5 Credits - Semester 3 Required ME223: Thermodynamics and Fluid Mechanics - 5 Credits - Semester 3 Required EE231: Electronic Instrumentation and Sensors - 5 Credits - Semester 3 Required CE227: Strength of Materials - 10 Credits - Semester 3 Required ST1100: Engineering Statistics - 5 Credits - Semester 3 Required ME2106: Theory of Machines and CADD - 5 Credits - Semester 3 Required ME2105: Manufacturing Technology and CAIRDE - 5 Credits - Semester 3 Required BME2100: Materials I - 5 Credits - Semester 4 Required EE230: Electrical Circuits & Systems - 5 Credits - Semester 4 Required ME5105: Fundamentals of Operations Engineering - 5 Credits - Semester 4 Required MA2102: Mathematics and Applied Mathematics II - 5 Credits - Semester 4 Year 3 (60 Credits) Required ME3108: CADD - 5 Credits - Semester 5 Required ME322: Thermodynamics and Heat Transfer - 5 Credits - Semester 5 Optional ME3104: Introduction to Regulatory Affairs in Manufacturing - 5 Credits - Semester 6 Required EE3101: Electromechanical Power Conversion - 5 Credits - Semester 5 Required ME301: Fluid Dynamics - 5 Credits - Semester 5 Required EE352: Linear Control Systems - 5 Credits - Semester 5 Required ME304: Mechanical Analysis And Design - 5 Credits - Semester 5 Required ME5102: Quality Systems - 5 Credits - Semester 5 Optional ME3107: Machine Design Project - 10 Credits - Semester 6 Required ME431: Systems Reliability - 5 Credits - Semester 6 Required ME312: Automated Systems - 5 Credits - Semester 6 Required ME352: Mechanical Vibrations - 5 Credits - Semester 6 Required ME353: Quality Systems - 5 Credits - Semester 6 Year 4 (60 Credits) Optional BME400: Biomechanics - 5 Credits - Semester 7 Optional ME4105: Safety Engineering - 5 Credits - Semester 7 Optional IE450: Lean Systems - 5 Credits - Semester 7 Optional EE450: Power Systems - 5 Credits - Semester 7 Required ME4109: Materials II - 5 Credits - Semester 7 Required ME424: Energy Conversion - 5 Credits - Semester 7 Required BME402: Computational Methods in Engineering Analysis - 10 Credits - Semester 7 Required ME4107: Mechanical Engineering Fourth Year Project - 15 Credits - Semester 7 Optional ME4101: Combustion Science and Engineering - 5 Credits - Semester 8 Optional ME426: Turbomachines and Advanced Fluid Dynamics - 5 Credits - Semester 8 Optional ME431: Systems Reliability - 5 Credits - Semester 8 Required ME4106: 4th Year Machine Design Project - 5 Credits - Semester 8 Required ME402: Advanced Mechanical Analysis And Design - 5 Credits - Semester 8",
    "minimum_entry_requirements": "Entry Requirements Minimum Grade H5 in two subjects and passes in four other subjects at O6/H7 Level in the Leaving Certificate, including Irish, English, Mathematics, a laboratory science subject (i.e., Chemistry, Physics, Biology, Physics with Chemistry (joint), Agricultural Science or Computer Science) or Technology, and any two other subjects recognised for entry purposes.   Additional Requirements Students must obtain a minimum of Grade H4 in the Higher Level Leaving Certificate paper in Mathematics or, alternatively places available (which may vary in number year to year) may be allocated to those candidates who have achieved the points requirement for the programme that year, who satisfy the general requirements for Matriculation in the College of Engineering and Informatics and who attain a Pass in the Engineering Maths Qualifying Examination. The places available will be allocated in strict order of merit based points attained in the Leaving Certificate. Due to capacity constraints, not all candidates who achieve a pass in the examination may receive an offer.  For A-Levels: A minimum of Grade C in Mathematics is required",
    "video": "",
    "faculty_information_lecturer": "David Finn",
    "faculty_information__lecturer_image_url": "https://youtu.be/-Mts7f_mW8w",
    "faculty_information__id": 18,
    "job_opportunities_and_salary_expectations": "Career Opportunities As Mechanical Engineering is perhaps the most wide ranging of engineering disciplines, it offers diverse career opportunities. Graduates go on to work in such areas as research, industrial design, project management, environmental protection, energy production, technical sales, process control, manufacturing, aeronautics, and materials and product development. For students interested in pursuing further education, the PhD and MEngSc degrees are obtained through doing research work along with advanced study. Research students specialise in an area of research, working with a high degree of independence.",
    "clubs_and_societies": "https://socs.nuigalway.ie/societies/",
    "course_reviews_and_testimonials": "",
    "map_info": "https://www.universityofgalway.ie/buildings/maps/",
    "students_accomodation_link": "https://www.universityofgalway.ie/student-life/accommodation/",
    "workshops": "https://libguides.library.nuigalway.ie/events"
  }
  {
    "college": "NUI Galway",
    "course": "GY320 Physics-degree options in Applied, Astrophysics, Biomedical, Climate, Theoretical",
    "code": "GY320",
    "title": "Physics-degree options in Applied, Astrophysics, Biomedical, Climate, Theoretical",
    "course_type": "Undergraduate",
    "course_starts": "September",
    "fees": "7,408.00",
    "level": "Level 8",
    "award": "Bachelor of Science (Physics-degree options in Applied, Astrophysics, Biomedical, Climate, Theoretical)",
    "duration": "4 years",
    "mode_of_study": "Full Time",
    "method_of_delivery": "Face-to-Face",
    "commencement_date": "September",
    "location": "Galway",
    "thumbnail_image_url": "",
    "website_url": "https://www.universityofgalway.ie/",
    "course_description": "Physics is the fundamental science, which seeks to understand the basic laws governing the structure of matter, the nature of energy and the physical forces that form our world. Its span of interest ranges from the nature of the short-range forces which operate inside the atomic nucleus to the origin and structure of the universe.  If you have an enquiring mind, and are interested in discovering how things work, then this could be the course for you. The Bachelor of Science (Physics degree options in Applied, Astrophysics, Biomedical, Climate, Theoretical) four year degree at University of Galway offers you the flexibility in how you can study physics. It gives you the opportunity to experience a number of subjects along with core Physics before specialising in your chosen pathway in third year.  These pathways are:  Applied Physics, the study of physics with particular emphasis on technological and practical applications Astrophysics, the part of astronomy that deals with the physics of the universe, including that of stars, black holes and galaxies Biomedical Physics, the application of physics to the medical and biological sciences Theoretical Physics, the application of mathematical tools and models to explain and predict physical phenomena Climate Physics, focussed on understanding the physics of climate change from a rigorous-science perspective, a study of the key processes driving climate change, enabling a response on a regional, national and international scale You will be introduced to these pathways at the very start of the programme. Students will gain an insight into some of the most exciting and interesting areas of scientific inquiry.   Do I need honours level Mathematics?  No, but physics is mathematical. In the first and second year you will be required to take mathematics courses, which will bring you to the standard required.  Do I need Leaving Certificate physics?  Leaving Certificate physics will help you but it is not a requirement. We will teach you physics in first year.",
    "course_content": "Year 1 Physics Physics Specialist Topics Applied Mathematics or Biology Mathematics  Year 2 Physics (four modules) Plus eight additional modules chosen from an approved list in the following areas: Applied Mathematics Astrophysics Anatomy Mathematics Earth and Ocean Sciences (Climate stream) Megatrends (Economics and Business) Year 3 Physics (six modules) Plus six additional modules chosen from an approved list in the following areas: Applied physics Astrophysics Biomedical Physics Theoretical Physics Other modules available in the College of Science Year 4 Core Physics modules Specialist Physics courses (Applied, Astrophysics, Biomedical, Theoretical,Climate) Plus advanced laboratory, project work and problem solving",
    "minimum_entry_requirements": "Entry Requirements Minimum Grade H5 in two subjects and passes in four other subjects at O6/H7 level in the Leaving Certificate, including Irish, English, Mathematics, a laboratory science subject (i.e, Chemistry, Physics, Biology, Physics with Chemistry (joint), Computer Science or Agricultural Science) and any two other subjects recognised for entry purposes.",
    "video": "",
    "faculty_information_lecturer": "Dr Alexander Goncharov",
    "faculty_information__lecturer_image_url": "https://youtu.be/-Mts7f_mW8w",
    "faculty_information__id": 19,
    "job_opportunities_and_salary_expectations": "Career Opportunities A degree in physics is an excellent training for employment in high technology industries (e.g. communications, electronics, optics and photonics, semiconductors, medical devices) and also in fields such as second- and third-level education,climate science, meteorology, the environmental and medical sciences, and software design.  A physics degree can also lead to an exciting career in fundamental research in any area of physics or in multidisciplinary areas such as nanotechnology, medical physics, biophysics, occupational health, and materials science. Theoretical physicists often work in the financial and actuarial sectors.  Click here to read a report produced for the Institute of Physics which shows 160,000 people are employed in physics based industries in Ireland.",
    "clubs_and_societies": "https://socs.nuigalway.ie/societies/",
    "course_reviews_and_testimonials": "",
    "map_info": "https://www.universityofgalway.ie/buildings/maps/",
    "students_accomodation_link": "https://www.universityofgalway.ie/student-life/accommodation/",
    "workshops": "https://libguides.library.nuigalway.ie/events"
  }
  {
    "college": "NUI Galway",
    "course": "GY410 Project and Construction Management",
    "code": "GY410",
    "title": "Project and Construction Management",
    "course_type": "Undergraduate",
    "course_starts": "September",
    "fees": "7,408.00",
    "level": "Level 8",
    "award": "Bachelor of Science (Project and Construction Management)",
    "duration": "4 years",
    "mode_of_study": "Full Time",
    "method_of_delivery": "Face-to-Face",
    "commencement_date": "September",
    "location": "Galway",
    "thumbnail_image_url": "",
    "website_url": "https://www.universityofgalway.ie/",
    "course_description": "Over the past few decades, construction management has developed into a specific and necessary role within the construction industry as projects have increased in size and complexity and the need to deliver them in a timely, efficient manner has become critical. The BSc in Project and Construction Management is an interdisciplinary degree programme, providing students with an extensive training in both construction management and project management, essential managerial aspects to carrying out large, complex projects in industry. This degree programme prepares graduates for taking on technical, management, academic and research/development level positions in the construction industry, as well as across a range of other industries such as in the bio-pharmaceutical, technology and science industries.  Despite the downturn in the economy, construction remains hugely important as an industry and there is an ever-present need for skilled and resourceful project managers, nationally and internationally, as companies seek to carry out projects as efficiently and effectively as possible. The construction industry has seen many rapid changes in recent years, with the advent of new technologies and the extensive use of computer-based techniques. Added to this are developments in new materials with enhanced performance and new construction techniques. There is also the interdisciplinary challenge, with a blurring of boundaries taking place between traditional roles, both in construction and other areas requiring highly developed managerial skills in the overseeing of complex projects.   Becoming a project and construction manager will mean you will be trained in the fundamentals of civil engineering, construction, and business and economics. You will learn about managerial and accounting principles, get an introduction to human resources management and progress to getting an insight into the concepts of financial management. Other focuses over the four-year programme are health and safety law, quality management and planning, which is evolving to take account of changing environmental concerns, and sustainability issues. The course will provide you with the capacity to critically analyse and apply problem solving skills across a growing and diverse number of construction specialisms.",
    "course_content": "Required CE141: Introduction to Engineering and Design - 15 Credits - Semester 1 Required MA1161: Mathematical Studies - 10 Credits - Semester 1 Required MG1100: Contemporary Management Thought - 5 Credits - Semester 1 Required AY104: Introduction to Financial Accounting - 5 Credits - Semester 1 Required CT1110: Engineering Computing I - 5 Credits - Semester 1 Required EI160: Engineering Graphics - 5 Credits - Semester 1 Required MG1101: Management and Enterprise - 5 Credits - Semester 1 Required AY105: Introduction to Management Accounting - 5 Credits - Semester 2 Required CE119: Fundamentals of Project & Construction Management - 5 Credits - Semester 2 Required PH150: Introduction to Physics - 5 Credits - Semester 2 Year 2 (60 Credits) Required CE2101: Principles of Building - 5 Credits - Semester 3 Required CE227: Strength of Materials - 10 Credits - Semester 3 Required AY207: Management Accounting I - 5 Credits - Semester 3 Required LW3114: Introduction to Law - 5 Credits - Semester 3 Required IE225: Project Planning and Organisation - 5 Credits - Semester 3 Required CE2100: Building Information Modelling - 5 Credits - Semester 3 Required ST2001: Statistics for Data Science 1 - 5 Credits - Semester 3 Required CE2103: Construction Practice - 5 Credits - Semester 4 Required CE2102: Community Engaged Building Project - 5 Credits - Semester 4 Required ME5105: Fundamentals of Operations Engineering - 5 Credits - Semester 4 Required CE222: Civil Engineering Materials and Design - 5 Credits - Semester 4 Year 3 (60 Credits) Required CE3109: Professional Practice in Project & Construction Management - 5 Credits - Semester 5 Required CE3104: Design of Structures II - 5 Credits - Semester 5 Required CE343: Sustainable Energy - 5 Credits - Semester 5 Required EC5133: Principles of Economics for Business - 5 Credits - Semester 5 Required ME5102: Quality Systems - 5 Credits - Semester 5 Required CE334: Construction Operations - 5 Credits - Semester 5 Required MG328: Human Resource Management - 5 Credits - Semester 5 Required IE309: Operations Research - 5 Credits - Semester 5 Required ME353: Quality Systems - 5 Credits - Semester 6 Required CE3103: Design of Structures I - 5 Credits - Semester 6 Required CE471: Project Management - 5 Credits - Semester 6 Required CE3108: Professional Experience Programme in Project and Construction Management - 5 Credits - Semester 6 Required CE338: Project Planning & Organisation II - 5 Credits - Semester 6 Year 4 (60 Credits) Required EC2100: Applied Microeconomics for Business - 5 Credits - Semester 7 Required CE447: Final Year Project - 10 Credits - Semester 7 Required CE3105: Environmental Engineering - 5 Credits - Semester 7 Required IE448: Safety & Construction - 5 Credits - Semester 7 Required ME432: Technology Innovation & Entrepreneurship - 5 Credits - Semester 7 Required IE450: Lean Systems - 5 Credits - Semester 7 Required CE471: Project Management - 5 Credits - Semester 8 Required MG2101: Entrepreneurial Venture Development - 5 Credits - Semester 8 Required CE468: Estimates and Costing - 5 Credits - Semester 8 Required LW290: Business Law II - 5 Credits - Semester 8 Required CE476: The Built Environment - 5 Credits - Semester 8",
    "minimum_entry_requirements": "Entry Requirements Minimum Grade H5 in two subjects and passes in four other subjects at O6/H7 Level in the Leaving Certificate, including Irish, English, Mathematics, and either Laboratory Sciences subject (such as Agricultural Science, Biology, Chemistry, Physics and Chemistry (joint), Physics or Computer Science), Technology, Engineering, Design and Communication Graphics or Construction Studies, and any other subjects recognised for entry purposes.   Additional Requirements Students must obtain a minimum Grade O3 or H7 in Mathematics or, alternatively places available (which may vary in number year to year) may be allocated to those candidates who have achieved the points requirement for the programme that year, who satisfy the general requirements for Matriculation in the School of Engineering and who attain a Pass in the Engineering Maths Qualifying Examination. The places available will be allocated in strict order of merit based points attained in the Leaving Certificate. Due to capacity constraints, not all candidates who achieve a pass in the examination may receive an offer.",
    "video": "",
    "faculty_information_lecturer": "Deirdre Duane",
    "faculty_information__lecturer_image_url": "https://youtu.be/-Mts7f_mW8w",
    "faculty_information__id": 20,
    "job_opportunities_and_salary_expectations": "Career Opportunities The project management skills gained from the programme will be marketable across a wide range of industries that include biopharma, technology, and science. Graduates will be qualified to work as engineering assistants or construction project managers or their assistants, and in various supervisory positions, such as in building maintenance.",
    "clubs_and_societies": "https://socs.nuigalway.ie/societies/",
    "course_reviews_and_testimonials": "",
    "map_info": "https://www.universityofgalway.ie/buildings/maps/",
    "students_accomodation_link": "https://www.universityofgalway.ie/student-life/accommodation/",
    "workshops": "https://libguides.library.nuigalway.ie/events"
  }
  {
    "college": "NUI Galway",
    "course": "GY301 Science",
    "code": "GY301",
    "title": "Science",
    "course_type": "Undergraduate",
    "course_starts": "September",
    "fees": "7,408.00",
    "level": "Level 8",
    "award": "Bachelor of Science",
    "duration": "4 years",
    "mode_of_study": "Full Time",
    "method_of_delivery": "Face-to-Face",
    "commencement_date": "September",
    "location": "Galway",
    "thumbnail_image_url": "",
    "website_url": "https://www.universityofgalway.ie/",
    "course_description": "The GY301 Bachelor of Science degree programme allows you to take a variety of subjects in Science before you decide which scientific area to specialise in for your four-year honours degree. It is the ideal choice for students who are interested in several areas of science and who want the flexibility to explore their scientific interests further before committing to a particular specialism.  The programme provides a solid foundation in Science subjects in the first year, with module offerings in Biology, Chemistry, Physics, Mathematics, Mathematical Studies, Computing and Applied Mathematics.  Progressing into second and third year you can choose from a wide range of 20 different specialties, referred to as pathways, including Chemistry, Medicinal Chemistry, Biochemistry, Microbiology, Plant and AgriBiosciences, Botany and Plant Science, Zoology, Earth and Ocean Sciences, Physics and Applied Physics, Physics and Climate Physics, Mathematics, Applied Mathematics, Computing, Data Science, Anatomy, Physiology, Pharmacology.  You can study up to three of those pathways in Year 2, continuing with up to two pathways in Year 3, before choosing a single specialism for Year 4 of the programme, giving flexibility to discover your unique interests and build a tailored skillset that will lead you onto your scientific specialism.  To ensure quality in student experience, places in some pathways are limited, a quota system applies to pathways in Year 2.  The pathways are designed and delivered by research-active lecturers and thus incorporate course content inspired by current research trends, including public policy and industry partnership, whilst emphasising the importance of science communication. Our curricula embed sustainability and the principles of the UNs Sustainable Development Goals, feature innovative teaching methods, and draw on our wide range of strengths from across the sciences at University of Galway.",
    "course_content": "Year 1 A student chooses four 15-credit modules from the following:     Biology BO101 Chemistry CH101 Physics PH101 Mathematics (Honours) MA180 Mathematical Studies MA161 Applied Mathematics MP180 Computer Science CS102 Each Year 1 module is available to each student of the GY301 Bachelor of Science programme, with no limits on places, with only the constraint that students must choose at least one module from:  MA180, MA161 or MP180. Only one of MA180 (tailored for students who may wish to consider a degree specialism in mathematics or data science) and MA161 (which guides students in analytic skills required for scientists) may be taken. The combination of modules chosen in Year 1 will be important as requirements in selecting focused pathways of study from Year 2. First year students will have an advisory session to aid in module selection, and further information and guidance can be found in the 1st year student handbook.  Year 1 modules are supported by lectures, which provide discussion and demonstration of topics, by tutorials or workshops, and by practical classes offering extensive and hands-on laboratory experience. Students are supported by the CIM shared peer learning initiative, by the SUMS Centre (Support for Undergraduate Mathematics and Statistics) and an Advisory Scheme in which each student has a contact point with an academic staff member to help answer general queries throughout their first year.  Year 2 In Year 2 of the programme students begin a specialised path of study. Modules are grouped by focused themes providing a pathway toward a specialism. Students can study up to three pathways in Year 2, where eligibility for the pathways depends on the combination of modules chosen in Year 1. Note that places on some pathways are limited  advisory sessions are provided, during which pathway advisors will be available to discuss module options.      Years 3 and 4 In year 3 of the programme students continue their focused paths of study, retaining up to two pathways, choosing a single specialism in either Year 3 or Year 4. In Year 4 - the final year - students study advanced modules and undertake an intensive research project in their chosen area guided by an academic supervisor, leading to their specialist Bachelor of Science degree.     Pathways: Pathways Years 2-4:  Anatomy Applied Mathematics Biochemistry Botany and Plant Science Chemistry Computing Data Science Earth and Ocean Sciences Mathematics Mathematics and Applied Mathematics Mathematical Studies and Computing Mathematics and Computing Medicinal Chemistry Microbiology Pharmacology Physics and Applied Physics Physics and Climate Physics Physiology Plant and AgriBiosciences Zoology",
    "minimum_entry_requirements": "Entry Requirements Minimum Grade H5 in two subjects and passes in four other subjects at O6/H7 level in the Leaving Certificate, including Irish, English, Mathematics, a laboratory science subject (i.e. Chemistry, Physics, Biology, Physics with Chemistry (joint) or Agricultural Science) and any two other subjects recognised for entry purposes.",
    "video": "",
    "faculty_information_lecturer": "Dr Emma Holahan",
    "faculty_information__lecturer_image_url": "https://youtu.be/-Mts7f_mW8w",
    "faculty_information__id": 21,
    "job_opportunities_and_salary_expectations": "Career Opportunities University of Galway  is a research-intensive university, where our teaching is inspired by our global research impact.  On the completion of your degree, as a University of Galway Bachelor of Science graduate you will be equipped with the scientific knowledge and methods, creative problem-solving aptitude and innovation ability required to foster lifelong critical thinking.   Modules and pathways are designed to instill scientific techniques, transferrable skills, and the ability to work equally well individually or in teams. These skills are essential for any career orientated towards research and development (R&D) as well as many other professional careers in industrial, academic and public sectors.  The GY301 Bachelor of Science programme is a degree that will empower you to join the next generation of graduates who will face and solve some of the challenges of our changing world, from mitigating against irreversible climate change, meeting the worlds food and energy demands or developing knowledge and technology to protect the health of society and the environment.",
    "clubs_and_societies": "https://socs.nuigalway.ie/societies/",
    "course_reviews_and_testimonials": "",
    "map_info": "https://www.universityofgalway.ie/buildings/maps/",
    "students_accomodation_link": "https://www.universityofgalway.ie/student-life/accommodation/",
    "workshops": "https://libguides.library.nuigalway.ie/events"
  }