 {
   "college": "Munster Technological University",
   "course": "Agriculture - Clonakilty / Cork Campus ",
   "code": "MT750",
   "title": "Agriculture - Clonakilty / Cork Campus",
   "course_type": "Undergradaute",
   "course_starts": "September",
   "fees": "  7,348.00",
   "level": "Level 7",
   "award": "BSc",
   "duration": "3 Years",
   "mode_of_study": "Full-time",
   "method_of_delivery": "Classroom",
   "commencement_date": "Sep-23",
   "location": "Cork",
   "thumbnail_image_url": "",
   "website_url": "https://www.cit.ie/course/MT750",
   "course_description": "Overview Agriculture is of major importance in the Irish economy. The agri-business sector has been identified as a major sector for growth in the coming years across a range of associated industries.  The students attend both MTU and Teagasc Clonakilty Agricultural College throughout the course.    In year 1, students typically spend two days a week in Teagasc Clonakilty Agricultural College and three days in MTU Bishopstown Campus.    In year 2, students typically spend two days a week in Teagasc Clonakilty Agricultural College and three days in MTU Bishopstown Campus.    In year 3, students typically spend five days a week in MTU Bishopstown Campus.  Students are required to complete a minimum of 15 weeks work placement in year 2 in an agriculture related business. It will involve a set of agreed objectives for your placement, as well as the assistance of a person on site and a member of the academic staff at Teagasc Clonakilty Agricultural College or MTU.  Students can choose to travel on work placement to international destinations such as New Zealand, Australia, USA, or UK. It is a fantastic opportunity for students to travel and learn simultaneously. Placement can also be organised in Ireland.",
   "course_content": "First Year at a Glance:   Crop Production: using land for maximum benefit while growing crops    Human/Animal & Plant Biology    Components of food and their role in human and animal nutrition    Maintenance and operation of farm machinery including tractors, crop sowing and harvesting    Finance for the agribusiness sector    Basic mathematics to assist with decision making in an agricultural enterprise    Workshops in animal management including experience with dairy, sheep and beef herds    Information Technology (IT) Skills    Soil Science: understanding the properties of soil and their impact on crop and animal production    Site visits e.g. National Ploughing Championships, and Moorepark Animal & Grassland Research and Innovation Centre",
   "minimum_entry_requirements": "Entry 2023 Score the necessary CAO points and meet Leaving Certificate Minimum entry requirements  5 Subjects Subjects O6/H7 5 Subjects H5 0 Maths Grade O6/H7 English or Irish Grade O6/H7",
   "video": "https://youtu.be/8lAQJ8wvKnQ",
   "faculty_information_lecturer": "Marie Dorgan",
   "faculty_information__lecturer_image_url": "",
   "faculty_information__id": 1,
   "job_opportunities_and_salary_expectations": "Further Studies Suitably qualified graduates (minimum overall grade of 40% in year 3 of the programme) are eligible to apply for entry to the one year add-on    Bachelor of Science (Honours) in Agriculture  Graduates of the programme can also pursue specialisations in agriculture with other Higher Education Institutes in Ireland and overseas.  Career Opportunities The course develops farming, business and management skills to enable graduates to follow careers as successful commercial farmers or in the agri-business sector. It will provide graduates with the skills they will need to be able to participate actively in policy decisions   whether they are local, regional or international   which will influence their profession and its role in a modern economy.    Farm manager   Agricultural consultant   Sales representative   Retail management",
   "clubs_and_societies": "https://societies.mtu.ie/",
   "course_reviews_and_testimonials": "",
   "map_info": "https://www.cit.ie/citcontacts.campus",
   "students_accomodation_link": "https://www.cit.ie/studentlife/accommodation/",
   "workshops": "https://societies.mtu.ie/"
 }
 {
   "college": "Munster Technological University",
   "course": "Analytical & Pharmaceutical Chemistry - Cork Campus",
   "code": "MT774",
   "title": "Analytical & Pharmaceutical Chemistry - Cork Campus",
   "course_type": "Undergradaute",
   "course_starts": "September",
   "fees": "  7,348.00",
   "level": "Level 7",
   "award": "BSc",
   "duration": "3 Years",
   "mode_of_study": "Full-time",
   "method_of_delivery": "Classroom",
   "commencement_date": "Sep-23",
   "location": "Cork",
   "thumbnail_image_url": "",
   "website_url": "https://www.cit.ie/course/MT774",
   "course_description": "Overview Analytical chemistry deals with the great variety of methods used to identify and quantify the chemical components of materials, while pharmaceutical chemistry focuses on aspects of drug design, synthesis, and manufacture.  Courses in chemistry at MTU have provided many of the highly skilled personnel at various levels required by the industry. School leavers are offered a flexible and attractive route through an extremely diverse science. The BSc in Analytical and Pharmaceutical Chemistry prepares students for laboratory-based careers; activities include preparation of chemicals and samples for use, analysis of raw materials and products of chemical processes, set-up/maintenance/use of chemical instrumentation. Computerised instruments and information technology are important in this work, and graduates may work in quality assurance, analysis, research, development, and production in a wide range of industrial sectors such as biopharmaceuticals, food and beverage, environmental analysis, etc.  The course aims to give students the knowledge and skills to practice chemistry in the laboratory environment.",
   "course_content": "First Year at a Glance:   Chemical Principles: study of general chemical Interactions    Physics: study of fundamental basis of energy, light and heat    Laboratory Skills: understanding the basis for good laboratory practice in a chemistry laboratory    Biology: study of fundamental building blocks of life    Mathematics: students use maths to problem solve    Creativity, Innovation and Teamwork: Team building, independent working and communication skills development",
   "minimum_entry_requirements": "Entry 2023 Score the necessary CAO points and meet Leaving Certificate Minimum entry requirements  5 Subjects Subjects O6/H7 5 Subjects H5 0 Maths Grade O6/H7 English or Irish Grade O6/H7",
   "video": "https://youtu.be/8lAQJ8wvKnQ",
   "faculty_information_lecturer": "Dr Lee (William) Doherty",
   "faculty_information__lecturer_image_url": "",
   "faculty_information__id": 2,
   "job_opportunities_and_salary_expectations": "Further Studies Graduates who have attained a minimum final average mark of 50% may proceed to year 4 (final year) of the Bachelor of Science (Honours) in Analytical Chemistry with Quality Assurance (ACQUA).  This in turn may lead to the option to proceed to postgraduate studies (MSc or PhD) in Chemistry at MTU or other universities in Ireland or abroad.  After obtaining the BSc (Honours) in Analytical Chemistry with Quality Assurance, graduates may apply for a 2 year, full time, Professional Master of Education (120 ECTS credits). On completion, graduates are eligible for registration with the Teaching Council.  Career Opportunities Career opportunities exist not only in the BioPharmaChem industry, but also in such diverse areas as environmental analysis, elemental analysis (metallurgy), and food/ beverage processing, forensic analysis, contaminant analysis (e.g. in sports), etc. Graduates have become senior technicians, analysts, laboratory managers, and quality control supervisors. Some have progressed into company management positions over the years, and some have started and managed their own companies.    Chemical laboratory technician   Laboratory quality assurance   Product development   Pharmaceutical production",
   "clubs_and_societies": "https://societies.mtu.ie/",
   "course_reviews_and_testimonials": "",
   "map_info": "https://www.cit.ie/citcontacts.campus",
   "students_accomodation_link": "https://www.cit.ie/studentlife/accommodation/",
   "workshops": "https://societies.mtu.ie/"
 }
 {
   "college": "Munster Technological University",
   "course": "Analytical Chemistry with Quality Assurance - Cork Campus",
   "code": "MT874",
   "title": "Analytical Chemistry with Quality Assurance - Cork Campus",
   "course_type": "Undergradaute",
   "course_starts": "September",
   "fees": "  7,348.00",
   "level": "Level 8",
   "award": "BSc Honours",
   "duration": "4 Years ",
   "mode_of_study": "Full-time",
   "method_of_delivery": "Classroom",
   "commencement_date": "Sep-23",
   "location": "Cork",
   "thumbnail_image_url": "",
   "website_url": "https://www.cit.ie/course/MT874",
   "course_description": "Overview Chemists analyse and understand everyday materials to determine efficient and safe ways of transforming them into useful products, develop new products and materials, and monitor production processes to ensure the quality of finished products.  Analytical Chemistry is the speciality dealing with devising, selecting, and using methods for determining the identity and quantity of chemical composition of samples such as drugs, medicines, food and beverage, water, air etc. These have key components that are present at very low levels or concentrations, and many sophisticated techniques have been developed for their detection and analysis.  The BSc (Honours) in Analytical Chemistry with Quality Assurance (ACQUA) prepares students for careers in the biopharmachemical industries and other areas such as environmental monitoring, food/beverage, oil and gas analysis, forensics, etc. Graduates identify and solve analytical problems by the selection and use of a wide range of methods and techniques   from the mainstream areas of spectroscopy, chromatography, and electrochemistry, to more specialised areas such as particle size analysis or immunoassay techniques.  This honours degree also focuses on quality assurance, which is of vital importance to the biopharmaceutical, chemical and allied industries. The course is examined using a combination of continuous assessment of both theory and practical work, and end of year examinations.  This honours degree is recognised by the Institute of Chemistry of Ireland for membership (MICI); graduates are also eligible to apply for Associate Membership of the Royal Society of Chemistry (AMRSC).",
   "course_content": "First Year at a Glance:   Chemical Principles: study of general chemical interactions    Physics: study of fundamental basis of energy, light and heat    Laboratory Skills: understanding the basis for good laboratory practice in a chemistry laboratory    Biology: study of fundamental building blocks of life    Mathematics: students use maths to problem solve    Creativity, Innovation and Teamwork: Team building, independent working and communication skills development",
   "minimum_entry_requirements": "Entry 2023 Score the necessary CAO points and meet Leaving Certificate Minimum entry requirements  6 Subjects Subjects O6/H7 4 Subjects H5 2 Maths Grade 06/H7 English or Irish Grade O6/H7",
   "video": "https://youtu.be/8lAQJ8wvKnQ",
   "faculty_information_lecturer": "Dr Mary Lehane",
   "faculty_information__lecturer_image_url": "",
   "faculty_information__id": 3,
   "job_opportunities_and_salary_expectations": "Further Studies Graduates may apply for a 2 year, full time, Professional Master of Education (120 ECTS credits). On completion, graduates are eligible for registration with the Teaching Council.  Suitably qualified graduates can continue to postgraduate research study with a number of MTU research groups associated in areas such as Mass Spectrometry Analysis, Chemical Analysis (www.cappa.ie/), or progress to research centres elsewhere.  Career Opportunities Graduates are prepared for laboratory careers in the BioPharmaChem industries and other industries. They are qualified in areas such as quality standards, good manufacturing practice, total quality management, and regulatory compliance. They may take up leadership roles in areas such as method design and implementation, process validation, and management of quality systems. Graduates of this programme continue to find employment in a range of high demand rewarding roles, primarily in the regional advanced manufacturing sectors, in particular biopharma and chemical industries. Roles include:    BioPharma laboratory analyst   Quality management and regulatory compliance   Pharmaceutical and chemical research   Chemistry teaching   Environmental testing & analysis",
   "clubs_and_societies": "https://societies.mtu.ie/",
   "course_reviews_and_testimonials": "",
   "map_info": "https://www.cit.ie/citcontacts.campus",
   "students_accomodation_link": "https://www.cit.ie/studentlife/accommodation/",
   "workshops": "https://societies.mtu.ie/"
 }
 {
   "college": "Munster Technological University",
   "course": "Information Technology - Cork Campus",
   "code": "MT705",
   "title": "Information Technology - Cork Campus",
   "course_type": "Undergradaute",
   "course_starts": "September",
   "fees": "  7,348.00",
   "level": "Level 7",
   "award": "BSc",
   "duration": "3 Years",
   "mode_of_study": "Full-time",
   "method_of_delivery": "Classroom",
   "commencement_date": "Sep-23",
   "location": "Cork",
   "thumbnail_image_url": "",
   "website_url": "https://www.cit.ie/course/MT705",
   "course_description": "The first year curriculum is common for all degrees in the Department of Computer Science, MTU Bishopstown Campus. All first year students study the same modules and this means that students can transfer to another programme within the Department in year two if they meet the CAO entry requirements for that programme when they enter MTU Bishopstown Campus, Cork. This offers great flexibility for qualifying students who may wish to change programmes after year one. This flexibility allows a student to make a more informed decision one year into their studies.  Overview The programme provides students with the knowledge, skills and competencies in IT infrastructure, security, emerging technologies, systems management, database systems and IT applications. The programme is designed around five key strategic pillars; Networking, Security, Cloud Computing Technologies, Scripting and Database Systems. The students who enrol on this programme will study modules aligned to the above areas.  Students will also learn about Information Security, a rapidly expanding sector in the computer industry. As more technology goes online, students will learn how secure private and sensitive information is most at risk from cyberattacks. The aim of the degree is to produce graduates with skills in IT infrastructure, operating systems, systems administration, cloud computing technologies and cybersecurity. Graduates will be able to design, deploy and administer virtualised environments, deploy and configure networks, and secure IT infrastructures and IT Systems. At a time of increasing reliance on IT services, the demand for graduates with the skills to implement and maintain IT infrastructure remains high. This programme is specifically designed to address this need.  In Year 3, work placement runs from January. Placements for students are organised on a country-wide basis with a particular focus on Cork and Dublin. Students can also work abroad.",
   "course_content": "First Year at a Glance: The first year curriculum is a common curriculum for all students and focuses on the fundaments of Computer Science.  Modules include:   Programming Fundamentals   Web Development Fundamentals   Computer Architecture   Computer Security Principles   Maths for Computer Science   Modular Programming   Introduction to Databases   Operating Systems in Practice   Networking Fundamentals   Physical Computing",
   "minimum_entry_requirements": "Entry 2023 Score the necessary CAO points and meet Leaving Certificate Minimum entry requirements  5 Subjects Subjects O6/H7 5 Subjects H5 0 Maths Grade O6/H7 English or Irish Grade O6/H7",
   "video": "https://youtu.be/8lAQJ8wvKnQ",
   "faculty_information_lecturer": "Pat McCarthy",
   "faculty_information__lecturer_image_url": "",
   "faculty_information__id": 4,
   "job_opportunities_and_salary_expectations": "Further Studies Graduates who have achieved an average of 50% are eligible to apply for year 4 (final year) of    BSc (Honours) in IT Management (MT 805)  Career Opportunities Graduates who can coordinate and supervise the configuration, testing and deployment of IT Services and the ongoing support of those systems and their users are in constant demand.    IT Support engineer   Database administrator   Network administrator   System administrator",
   "clubs_and_societies": "https://societies.mtu.ie/",
   "course_reviews_and_testimonials": "",
   "map_info": "https://www.cit.ie/citcontacts.campus",
   "students_accomodation_link": "https://www.cit.ie/studentlife/accommodation/",
   "workshops": "https://societies.mtu.ie/"
 }
 {
   "college": "Munster Technological University",
   "course": "Automotive Technology & Management - Cork Campus",
   "code": "MT747",
   "title": "Automotive Technology & Management - Cork Campus",
   "course_type": "Undergradaute",
   "course_starts": "September",
   "fees": "  7,348.00",
   "level": "Level 7",
   "award": "BSc",
   "duration": "3 Years",
   "mode_of_study": "Full-time",
   "method_of_delivery": "Classroom",
   "commencement_date": "Sep-23",
   "location": "Cork",
   "thumbnail_image_url": "",
   "website_url": "https://www.cit.ie/course/MT747",
   "course_description": "Overview Motor vehicle technology and the motor industry in general have undergone dramatic changes in recent times. Technological advances have made vehicles more efficient, more environmentally friendly, and safer, whilst at the same time strict standards are being enforced by manufacturers, distributors and retailers.  The motor and transport industries require highly qualified people at supervisory and management level. This course is designed to take account of these advances and it prepares graduates for employment within such a dynamic industry.  The course has a unique combination of theoretical and applied areas of study in conjunction with relevant business subjects. This course aims to provide the graduate with the practical, analytical, managerial, and interpersonal skills necessary for a successful career within the automotive industry.  The course is taught through a combination of lectures, practical work and assignments related to practical aspects, e.g. motor vehicle technology, garage practice, automobile electronics, advanced diagnostics, CAD/vehicle design, etc.  Graduates will have a comprehensive understanding of the wider business and economic context which the automotive sector operates within, and an appreciation of the importance of high ethical standards within the automotive sector.",
   "course_content": "First Year at a Glance:   Engine Technology: classroom based instruction on engine construction and operating principles    Automotive Science: scientific principles relating to automobile design and operation    Automobile Electrical Systems: the electrical and electronic systems which are used to provide comfort, safety & efficiency in modern vehicles    Garage Practice: practical knowledge and workshop experience of modern motor vehicles    Automotive Administration: management of the service system using computer systems for e.g. parts ordering and tracking, monitoring, billing for the service operation    Vehicle Dynamics: classroom based instruction on vehicle transmission and running gear construction and operating principles    Automotive Mathematics: fundamental Mathematical calculations and problem solving for automotive applications",
   "minimum_entry_requirements": "Entry 2023 Score the necessary CAO points and meet Leaving Certificate Minimum entry requirements  5 Subjects Subjects O6/H7 5 Subjects H5 0 Maths Grade O6/H7 English or Irish Grade O6/H7",
   "video": "https://youtu.be/8lAQJ8wvKnQ",
   "faculty_information_lecturer": "Dr Clive Atkinson",
   "faculty_information__lecturer_image_url": "",
   "faculty_information__id": 5,
   "job_opportunities_and_salary_expectations": "Further Studies Degree holders who achieve the specified level of academic performance may progress to the one year add on    Bachelor of Science (Honours) in Transport Management  Career Opportunities This degree provides varied and rewarding career opportunities in many types of enterprise throughout the industry ranging from motor dealerships to vehicle manufacturing and transport companies. Employment opportunities include supervisory, management and technical positions within sales and after-sales sectors of the motor, transport, and fleet industries. The degree lends itself towards a career within vehicle distributors/manufacturers along with vehicle assessing. Business start-up opportunities are also possible.    Motor dealerships: sales and after-sales departments   Transport and logistics companies   Motor vehicle distributor organisations   Motor vehicle assessors",
   "clubs_and_societies": "https://societies.mtu.ie/",
   "course_reviews_and_testimonials": "",
   "map_info": "https://www.cit.ie/citcontacts.campus",
   "students_accomodation_link": "https://www.cit.ie/studentlife/accommodation/",
   "workshops": "https://societies.mtu.ie/"
 }
 {
   "college": "Munster Technological University",
   "course": "Nautical Science - NMCI Ringaskiddy",
   "code": "MT766",
   "title": "Nautical Science - NMCI Ringaskiddy",
   "course_type": "Undergradaute",
   "course_starts": "September",
   "fees": "  7,348.00",
   "level": "Level 7",
   "award": "BSc",
   "duration": "3 Years",
   "mode_of_study": "Full-time",
   "method_of_delivery": "Classroom",
   "commencement_date": "Sep-23",
   "location": "Cork",
   "thumbnail_image_url": "",
   "website_url": "https://www.cit.ie/course/MT766",
   "course_description": "Overview Nautical science has three main elements: navigation, cargo operations, and ship handling. In other words, the control of a ship; the safe operation of a ship, including the protection of life and the environment; Shipboard administration, and the handling, loading and care of cargoes which may be as diverse as petroleum products, general cargo, or thousands of new cars or passengers.  This course is designed for those who wish to pursue a career as a deck officer aboard ship. It provides a comprehensive education in navigation and other ship board activities. Students who successfully complete year 1 can expect to be placed on a series of commercial ships in year 2, gaining between twelve and fifteen months seatime for practical training experience, and to gain the necessary  seatime  for the Department of Transport Certificate of Competency. In addition, students must complete a comprehensive workplace training programme including training records, journals and other documents associated with the training programme, as specified from time to time.  It should be noted that while every endeavour will be made to secure a suitable sea training berth, this is outside the control of MTU/NMCI and the College cannot accept responsibility for difficulties in securing such a berth.",
   "course_content": "First Year at a Glance:   Navigation & Meteorology: an introduction to both celestial and terrestrial navigation, together with an understanding of meteorology, as it relates to the seafarer    General Ship Knowledge: elements of ship construction, stability and cargo operations    Applied Nautical Science: the application of science and physics as it relates to the marine environment    Seamanship: the theory and practice of seamanship, having regard to safe working practices    Introduction to Shipboard Safety: includes short-course elements relating to firefighting, sea survival, and first aid training    Bridge Watchkeeping: an introduction to the theory and practice of keeping a safe navigational watch, having regard to the International Regulations for the Prevention of Collisions at Sea",
   "minimum_entry_requirements": "Entry 2023 Score the necessary CAO points and meet Leaving Certificate Minimum entry requirements  5 Subjects Subjects O6/H7 5 Subjects H5 0 Maths Grade O6/H7 English or Irish Grade O6/H7  Applicants must pass the approved medical fitness and eyesight tests as specified by the Irish Maritime Administration of the Department of Transport, and are strongly advised to attend a career advisory session.  NMCI s Department of Maritime Studies runs three CAO programmes:    MT 765 Marine Electrotechnology   MT 764 Marine Engineering   MT 766 Nautical Science  For admission to a programme, standard applicants must score the necessary CAO points, meet the minimum entry Leaving Certificate requirements, and note the following:  Note 1: The programme is normally available only to Irish citizens and EU citizens who are ordinarily resident in Ireland.  Note 2: Applicants must pass the approved medical fitness and eyesight tests as specified by the Irish Maritime Administration of the Department of Transport, and are strongly advised to attend a career advisory session. Offer of a place on the course will be subject to passing the medical and eyesight tests at the time of offer.  Note 3: Applicants, other than those indicated in Note 1, must be sponsored by an approved internationally trading shipping company, provide an IELTS score of 6.5, and also meet the medical and eyesight requirements for a sea going career.  Note 4: Applicants should note that in order to qualify for an Officer of the Watch Certificate of Competency (CoC), the Department of Transport has set additional criteria with respect to minimum pass marks, academic progression, and students with dyslexia. See Marine Notice No. 65 of 2013 (www.gov.ie)  Note 5: Applicants who are non-Irish citizens should ensure that they qualify for the issue of a Seafarer s Discharge Book in their country of citizenship.",
   "video": "https://youtu.be/8lAQJ8wvKnQ",
   "faculty_information_lecturer": "Capt. Sin ad Reen",
   "faculty_information__lecturer_image_url": "",
   "faculty_information__id": 6,
   "job_opportunities_and_salary_expectations": "Further Studies Suitably qualified Nautical Science graduates may continue their studies and obtain the BSc (Honours) Nautical Science degree and Chief Mate professional qualification, as an add-on year and continue to obtain the professional qualification of Master Unlimited  Career Opportunities Graduates first become officer of the watch on a vessel after graduating and passing relevant examinations. They can advance to chief mate or ship s captain with further study, examinations, and seatime. Career opportunities exist on a range of different types of ocean going vessels: bulk carriers, oil tankers, container ships, cruise and ferry vessels. There are also careers on specialist vessels, such as seismic and exploration ships, pilot vessels, tugs, and mega yachts.    Ship s officer (from junior ranks to captain)   Harbour master/pilot   Marine surveyor   Maritime studies lecturer",
   "clubs_and_societies": "https://societies.mtu.ie/",
   "course_reviews_and_testimonials": "",
   "map_info": "https://www.cit.ie/citcontacts.campus",
   "students_accomodation_link": "https://www.cit.ie/studentlife/accommodation/",
   "workshops": "https://societies.mtu.ie/"
 }
 {
   "college": "Munster Technological University",
   "course": "Science - Physical Sciences - Common Entry - Cork Campus",
   "code": "MT770",
   "title": "Science - Physical Sciences - Common Entry - Cork Campus",
   "course_type": "Undergradaute",
   "course_starts": "September",
   "fees": "  7,348.00",
   "level": "Level 7",
   "award": "BSc",
   "duration": "3 Years",
   "mode_of_study": "Full-time",
   "method_of_delivery": "Classroom",
   "commencement_date": "Sep-23",
   "location": "Cork",
   "thumbnail_image_url": "",
   "website_url": "https://www.cit.ie/course/MT945",
   "course_description": "Award Title: Dependent on chosen specialisation   Bachelor of Science in Applied Physics and Instrumentation   Bachelor of Science in Analytical & Pharmaceutical Chemistry  Overview The Physical Sciences (Common Entry) courses are designed for applicants who wish to enter a physical science course in MTU but are undecided about or wish to postpone selecting a designated chemistry or physics qualification until after they have had an opportunity to experience both disciplines.  Common Semester 1: The common semester 1 programme includes modules in Physics, Chemistry, Biology, Mathematics, and Computing so that students will have completed an introduction to general science by the end of semester 1.  At the end of semester 1, students choose the chemistry or physics degree course that they wish to pursue in semester 2.  Students on the Level 7 Physical Sciences Common Entry Programme MT 770 can apply to progress to one of two Level 7 science courses:    MT 782 BSc in Applied Physics and Instrumentation   MT 774 BSc in Analytical & Pharmaceutical Chemistry  Chemistry and physics are physical sciences and MTU delivers programmes focusing on the applied, industry-relevant aspects of these subjects. Science refers to a system of acquiring knowledge. This system uses observation and experimentation to describe and explain natural phenomena. Science is an excellent career choice for those interested in understanding how the chemicals, foods and other products that we encounter in everyday life are designed and produced. From cures for life threatening illnesses, to environmental protection, to the design of new foods and space science, careers in science are varied and interesting. The common entry mode to physical sciences offers students the opportunity to study a broad introduction to various science modules before deciding on their preferred stream in semester 2 of year 1.  Progression from Physical Sciences (Common Entry):  MT 770 Level 7:  BSc in Applied Physics and Instrumentation or  BSc in Analytical and Pharmaceutical Chemistry",
   "course_content": "First Semester at a Glance:   Biology: study of fundamental building blocks of life    Chemical Principles: study of general chemical Interactions    Physics: study of fundamental basis of energy, light and Heat    Laboratory Skills: understanding the basis for good laboratory practice in a chemistry laboratory    Mathematics: fundamental mathematical concepts and skills required to understand and solve problems in the modern world    Instrument Measurement: introduces the principles of measurement using a range of instruments and includes the theory and principles of operation of instrumentation pertaining to process and other industries    Creativity, Innovation and Teamwork: team building, independent working and communication skills development  Semester 2   Semester 2 modules are determined by the designated degree programme selected following completion of Semester 1.",
   "minimum_entry_requirements": "Entry 2023 Score the necessary CAO points and meet Leaving Certificate Minimum entry requirements  5 Subjects Subjects O6/H7 5 Subjects H5 0 Maths Grade O6/H7 English or Irish Grade O6/H7",
   "video": "https://youtu.be/8lAQJ8wvKnQ",
   "faculty_information_lecturer": "Eva Norris",
   "faculty_information__lecturer_image_url": "",
   "faculty_information__id": 7,
   "job_opportunities_and_salary_expectations": "",
   "clubs_and_societies": "https://societies.mtu.ie/",
   "course_reviews_and_testimonials": "",
   "map_info": "https://www.cit.ie/citcontacts.campus",
   "students_accomodation_link": "https://www.cit.ie/studentlife/accommodation/",
   "workshops": "https://societies.mtu.ie/"
 }
 {
   "college": "Munster Technological University",
   "course": "International Business with Language - Cork Campus",
   "code": "MT945",
   "title": "International Business with Language - Cork Campus",
   "course_type": "Undergradaute",
   "course_starts": "September",
   "fees": "  7,348.00",
   "level": "Level 8",
   "award": "BSc Honours",
   "duration": "4 Years ",
   "mode_of_study": "Full-time",
   "method_of_delivery": "Classroom",
   "commencement_date": "Sep-23",
   "location": "Cork",
   "thumbnail_image_url": "",
   "website_url": "https://www.cit.ie/course/MT771",
   "course_description": "Overview This programme is geared at meeting the skills shortage that has been identified for roles in businesses operating in various international environments. This may relate to business development, project management, supply chain management and other areas. Students will develop a broad understanding of business issues with an international perspective, while also studying a language of their choice. Topics such as culture, management, negotiation, trade, law, and much more underpin the programme.  In year 3, students will undertake a mandatory semester abroad in a country where the language they are learning is spoken widely. The programme has been designed to ensure that students have a wide range of opportunities upon completion. The semester abroad gives the student the opportunity to develop language skills and to develop a broader understanding of international cultures. While on semester abroad, some students will seek placement, which MTU will recognise, while others will seek to study for the semester. Where a student pursues a placement they do so under their own responsibility but with CV, interview and career guidance from MTU.  This programme has been revised recently to ensure that students have more opportunity to specialise through a broader range of modules on offer and through enhanced elective choices.",
   "course_content": "First Year at a Glance:   Develop an understanding of global business issues   as many Irish businesses and multinational companies trade internationally, this skill is in strong demand    Find out more about marketing, management, and culture. Culture is an essential element of this programme as it broadens your insight into the wider world    Build your teamwork and interpersonal skills by complementing your knowledge with strong interpersonal skills    Further your knowledge of a language of your choice (French, Spanish, or German) and commence your journey to having a very strong business level proficiency after 4 years",
   "minimum_entry_requirements": "Entry 2023 Score the necessary CAO points and meet Leaving Certificate Minimum entry requirements  6 Subjects Subjects O6/H7 4 Subjects H5 2 Maths Grade 06/H7 English or Irish Grade O6/H7 Relevant Language O1/H4 (Note 1)  Note 1: Please note the H4 grade in a relevant language can also be used to satisfy one of the H5 entry requirements.",
   "video": "https://youtu.be/8lAQJ8wvKnQ",
   "faculty_information_lecturer": "Katie Power",
   "faculty_information__lecturer_image_url": "",
   "faculty_information__id": 8,
   "job_opportunities_and_salary_expectations": "Further Studies Graduates may apply to professional bodies and may be exempt from certain examinations. Suitably qualified graduates are eligible to apply for postgraduate degrees at MTU:    MA in Global Business Practice   MA in Human Resource Management   MSc in Digital Marketing Strategy   MBA in Strategy   MBus (by Research)   PhD  Career Opportunities Graduates may pursue careers in a wide number of areas including business development, management, international marketing, multi-territory sales, new product development, logistics management, customer relationship management, international project management, trade promotion and development, services marketing and a wide variety of roles where a second European language is valued.    International business development   International sales management   Project and operations management   Logistics associate/manager   Supply chain manager/associate   Global project coordinator   International fundraising manager   Global human resources officer   Innovation specialist  Employers value employees who have lived abroad and we find that this is reflected in success for graduates of this programme at interviews.",
   "clubs_and_societies": "https://societies.mtu.ie/",
   "course_reviews_and_testimonials": "",
   "map_info": "https://www.cit.ie/citcontacts.campus",
   "students_accomodation_link": "https://www.cit.ie/studentlife/accommodation/",
   "workshops": "https://societies.mtu.ie/"
 }
 {
   "college": "Munster Technological University",
   "course": "Marine Electrotechnology - NMCI Ringaskiddy",
   "code": "MT765",
   "title": "Marine Electrotechnology - NMCI Ringaskiddy",
   "course_type": "Undergradaute",
   "course_starts": "September",
   "fees": "  7,348.00",
   "level": "Level 7",
   "award": "Beng",
   "duration": "3 Years",
   "mode_of_study": "Full-time",
   "method_of_delivery": "Classroom",
   "commencement_date": "Sep-23",
   "location": "Cork",
   "thumbnail_image_url": "",
   "website_url": "https://www.cit.ie/course/MT765",
   "course_description": "Overview An Electro-technical officer (ETO) operates, maintains and calibrates all electrical, electronic and ship s equipment. The ETO s role is not restricted to the engine room and they may also work on complex systems located throughout any vessel.  This is an exciting programme to cater for the growing need on board ship for a specialist in electrical/electronic/networking systems.  The course shares its first two semesters with MT 764 BEng in Marine Engineering. Having completed year 1, Marine Electrotechnology students begin specialist electrical and electronic training. As well as lectures, training is provided in a variety of workshops and laboratories. This practical work is given to enhance the students  learning experience. Practical knowledge of fundamental theory is gained in electrical, electronic, communications, and control laboratories. A broad understanding of ships and ships  systems is delivered in electrical workshops and in the College s own engine room.  Students who successfully complete year 1 and 2 are expected to be placed on a commercial ship, for practical training experience, and to gain the necessary  seatime  for an internationally recognised Certificate of Competency. While at sea they must complete a comprehensive workplace training programme.  It should be noted that while every endeavour will be made to secure a suitable sea training berth, this is outside the control of MTU/NMCI and the College cannot accept responsibility for difficulties in securing such a berth.",
   "course_content": "First Year at a Glance: The Marine Electrotechnology degree shares all but one of its first year modules with the Marine Engineering degree as graduates will be part of a vessel s engineering department and must understand the basics of marine engineering.    Shipboard Management for ETOs: covers work-based practices of an ETO and gives an understanding of maintenance systems, legislation, and safe working practices    Electrical and Electronic Principles: theoretical and practical principles of basic electrical and electronic components and circuits    Marine Power Systems: ships  power generation and distribution systems, and practical understanding of wiring basic control systems    Introduction to Marine Engineering: the principles and practical aspects of marine engineering systems found on board ship    Physics for Marine Engineers: physics principles underlying all engineering    Practice Mechanics: basic principles of forces and movements that are fundamental to engineering design    Mechanical Workshop: a practical workshop module which gives a fundamental understanding of materials and the fabrication of designed components    Technological Mathematics: offers great support to students in the first year of the engineering programme    Introduction to Thermodynamics: learn how to apply the First Law of Thermodynamics and distinguish between the concepts of heat and temperature",
   "minimum_entry_requirements": "Entry 2023 Score the necessary CAO points and meet Leaving Certificate Minimum entry requirements  5 Subjects Subjects O6/H7 5 Subjects H5 0 Maths Grade O6/H7 English or Irish Grade O6/H7  Applicants must pass the approved medical fitness and eyesight tests as specified by the Irish Maritime Administration of the Department of Transport, and are strongly advised to attend a career advisory session.  NMCI s Department of Maritime Studies runs three CAO programmes:    MT 765 Marine Electrotechnology   MT 764 Marine Engineering   MT 766 Nautical Science  For admission to a programme, standard applicants must score the necessary CAO points, meet the minimum entry Leaving Certificate requirements, and note the following:  Note 1: The programme is normally available only to Irish citizens and EU citizens who are ordinarily resident in Ireland.  Note 2: Applicants must pass the approved medical fitness and eyesight tests as specified by the Irish Maritime Administration of the Department of Transport, and are strongly advised to attend a career advisory session. Offer of a place on the course will be subject to passing the medical and eyesight tests at the time of offer.  Note 3: Applicants, other than those indicated in Note 1, must be sponsored by an approved internationally trading shipping company, provide an IELTS score of 6.5, and also meet the medical and eyesight requirements for a sea going career.  Note 4: Applicants should note that in order to qualify for an Officer of the Watch Certificate of Competency (CoC), the Department of Transport has set additional criteria with respect to minimum pass marks, academic progression, and students with dyslexia. See Marine Notice No. 65 of 2013 (www.gov.ie)  Note 5: Applicants who are non-Irish citizens should ensure that they qualify for the issue of a Seafarer s Discharge Book in their country of citizenship.",
   "video": "https://youtu.be/8lAQJ8wvKnQ",
   "faculty_information_lecturer": "Capt. Sin ad Reen",
   "faculty_information__lecturer_image_url": "",
   "faculty_information__id": 9,
   "job_opportunities_and_salary_expectations": "Further Studies There are opportunities for further study in related fields at honours degree level. Graduates will be well placed to pursue further studies in either electrical or electronic engineering.  Career Opportunities Electro-technical officers of a high standard are particularly sought after within the cruise line industry. There are also a number of opportunities ashore in a wide variety of fields including marine electronic maintenance and aviation instrumentation maintenance industries.",
   "clubs_and_societies": "https://societies.mtu.ie/",
   "course_reviews_and_testimonials": "",
   "map_info": "https://www.cit.ie/citcontacts.campus",
   "students_accomodation_link": "https://www.cit.ie/studentlife/accommodation/",
   "workshops": "https://societies.mtu.ie/"
 }
 {
   "college": "Munster Technological University",
   "course": "Engineering - Biomedical Engineering - Cork Campus",
   "code": "MT739",
   "title": "Engineering - Biomedical Engineering - Cork Campus",
   "course_type": "Undergradaute",
   "course_starts": "September",
   "fees": "  7,348.00",
   "level": "Level 7 ",
   "award": "Beng",
   "duration": "3 Years",
   "mode_of_study": "Full-time",
   "method_of_delivery": "Classroom",
   "commencement_date": "Sep-23",
   "location": "Cork",
   "thumbnail_image_url": "",
   "website_url": "https://www.cit.ie/course/MT739",
   "course_description": "Overview Biomedical engineering combines engineering with an appreciation of the functioning of the human body, whether healthy, injured or diseased. The medical device sector in Ireland is very strong; there are 300+ medical technology companies in Ireland, exporting  12.6b worth of product annually and employing 32,000 people, contributing 8% of Ireland s total merchandise exports. Products include prosthetic devices to improve quality of life, disposable plastic and wound care products, and precision implants including pacemakers, microelectronic devices, orthopaedic implants, diagnostics, contact lenses and stents. In the clinical context, biomedical engineers play a key role in designing, sourcing and maintaining equipment, facilities and services within hospitals. The course is delivered through formal lectures, tutorials, practical and project work. There are a number of dedicated biomedical engineering laboratories containing leading edge technology. These facilitate teaching and research both at undergraduate and postgraduate level and include:    Gait analysis laboratory   Biomaterials laboratory   Hurley helmet testing rig   Instron dynamic testing machine   Non-contact 3D light scanner   Rapid prototyping machine  Projects are carried out in conjunction with industry including medical device companies, with medical practitioners and with the Biomedical Engineering Unit of Cork University Hospital.  Accreditation This course in Biomedical Engineering is fully accredited by Engineers Ireland for Associate Engineer eligibility",
   "course_content": "First Year at a Glance:   Material Science: understanding the nature and properties of engineering materials    Mechanics: understanding the performance of engineering materials when subject to external loads and forces    Thermo/Fluid Mechanics: application of hot and cold fluid systems in engineering    CAD: computer-aided design similar to the Leaving Certificate subject Design and Communication Graphics    Instrumentation: understanding the operation and behaviour of medical equipment and devices    Anatomy    Mathematics    Biology",
   "minimum_entry_requirements": "Entry 2023 Score the necessary CAO points and meet Leaving Certificate Minimum entry requirements  5 Subjects Subjects O6/H7 5 Subjects H5 0 Maths Grade O6/H7 English or Irish Grade O6/H7",
   "video": "https://youtu.be/8lAQJ8wvKnQ",
   "faculty_information_lecturer": "Dr Paul Keane",
   "faculty_information__lecturer_image_url": "",
   "faculty_information__id": 10,
   "job_opportunities_and_salary_expectations": "Further Studies Suitably qualified graduates are eligible to apply for entry to year 3 of   Bachelor of Engineering (Honours) in Biomedical Engineering or the one year add-on   Bachelor of Engineering (Honours) in Advanced Manufacturing Technology  Career Opportunities Graduates will be qualified to work as biomedical engineering technologists within the healthcare, medical device industries, in research and development facilities, and also in clinical/hospital environments.    Biomedical device design and manufacturing   Research & development   Engineering Support within Clinical Environments   Regulated industries e.g. healthcare/food",
   "clubs_and_societies": "https://societies.mtu.ie/",
   "course_reviews_and_testimonials": "",
   "map_info": "https://www.cit.ie/citcontacts.campus",
   "students_accomodation_link": "https://www.cit.ie/studentlife/accommodation/",
   "workshops": "https://societies.mtu.ie/"
 }
 {
   "college": "Munster Technological University",
   "course": "Accounting - Cork Campus",
   "code": "MT942",
   "title": "Accounting - Cork Campus",
   "course_type": "Undergradaute",
   "course_starts": "September",
   "fees": "  7,348.00",
   "level": "Level 8",
   "award": "BSc Honours",
   "duration": "4 Years ",
   "mode_of_study": "Full-time",
   "method_of_delivery": "Classroom",
   "commencement_date": "Sep-23",
   "location": "Cork",
   "thumbnail_image_url": "",
   "website_url": "https://www.cit.ie/course/MT942",
   "course_description": "Overview The accounting function provides timely, relevant and accurate information to the management of the business. This information is also used to assess the financial  health  of the business and to make plans for the future. Accountants are involved in making many decisions necessary for the efficient operation of a business. Therefore, a well-run accounting function is critically important to the long-term management of a business.  This four year honours degree programme offers an advanced specialist education in accounting; providing a firm base for either further academic study, a career in business or for the pursuit of a professional qualification with one of the accountancy bodies. MTU offers accounting students the benefit of small class sizes initially which assists with a smoother transition from second level. MTU accounting lecturers have professional qualifications and relevant industry experience.",
   "course_content": "First Year at a Glance:   Financial Accounting: preparing accounts for business    Cost & Management Accounting: understanding accounting for decision making    Economics: understanding how people use resources    Law: understanding the legal system and how it affects business in Ireland    Exploring the role of a manager in business    Understanding the role of marketing for a company    Learning to work with computerised accounts software, e.g. Sage",
   "minimum_entry_requirements": "Score the necessary CAO points and meet Minimum Leaving Certificate entry requirements  6 Subjects Subjects O6/H7 4 Subjects H5 2 Maths Grade 04/H7 English or Irish Grade O6/H7",
   "video": "https://youtu.be/8lAQJ8wvKnQ",
   "faculty_information_lecturer": "Sylvia Dempsey",
   "faculty_information__lecturer_image_url": "",
   "faculty_information__id": 11,
   "job_opportunities_and_salary_expectations": "Further Studies Graduates with excellent exemptions from the professional accountancy bodies can enter industry or practice (i.e. work for an accounting practice). Suitably qualified graduates may apply to Master s programmes within MTU or other higher institutions.  Career Opportunities Graduates from MTU accounting programmes secure employment within accountancy practices and also as accountants in industry. Prior graduates have secured training positions with  Big 4  accountancy firms (PwC, KPMG, EY, and Deloitte), and with medium and small accountancy firms. Industry employers include Apple, Dell Technologies, Dairygold, Kerry Group, Quintas, Musgrave Group, South Western Services (SWS), Financial Control Outsourcing Services (FCOS), PepsiCo, Bank of New York Mellon, and State Street Bank.    Accountant in practice   Accountant in industry   Banking/Finance   Business analyst   Management consultant   Purchasing & procurement   Self employed/entrepreneur   Supply chain analyst   Teaching and lecturing",
   "clubs_and_societies": "https://societies.mtu.ie/",
   "course_reviews_and_testimonials": "",
   "map_info": "https://www.cit.ie/citcontacts.campus",
   "students_accomodation_link": "https://www.cit.ie/studentlife/accommodation/",
   "workshops": "https://societies.mtu.ie/"
 }
 {
   "college": "Munster Technological University",
   "course": "Agri-Biosciences - Cork Campus",
   "code": "MT879",
   "title": "Agri-Biosciences - Cork Campus",
   "course_type": "Undergradaute",
   "course_starts": "September",
   "fees": "  7,348.00",
   "level": "Level 8",
   "award": "BSc Honours",
   "duration": "4 Years ",
   "mode_of_study": "Full-time",
   "method_of_delivery": "Classroom",
   "commencement_date": "Sep-23",
   "location": "Cork",
   "thumbnail_image_url": "",
   "website_url": "https://www.cit.ie/course/MT879",
   "course_description": "Overview Biotechnology plays a crucial role in continuously improving the sustainability and productivity of the agri-food sector. The Agri-Biosciences degree programme is designed with industry collaborators to meet the growing need for scientists with excellent knowledge and technical competency in animal and plant biotechnologies.  The programme content is industry-focused, and topics covered are contemporary and relevant, both nationally and internationally. Lectures are supplemented with relevant examples, case studies, projects, site visits, web tools, and interactive media. There is a strong focus on practical biotechnological techniques with approximately 50% of the student s contact time spent in the laboratory gaining in-depth technical experience.  Year 1 and 2 of the programme provide a strong foundation in biology modules with students also undertaking programmespecific modules in animal and plant sciences, and agricultural and environmental biotechnology.  Year 3 and 4 of the programme provide further specialisation, with students covering core topics relevant to animal and plant biotechnologies including applications of DNA technologies, immunology, veterinary diagnostics, animal nutrition, reproduction, food safety, genetics, and the role of the microbiome in promoting health and sustainability.  The mandatory work placement in year 3 is an integral and exciting element of the programme in which the student joins the workforce of a relevant organisation for a full semester (Jan to Jun). The student acquires first-hand experience of industrial practices and modern analytical techniques, while further developing their professional and personal skills. Students also develop their networks through engagement with industry stakeholders.",
   "course_content": "First Year at a Glance:  As well as learning the main core science subjects in first year, students will also be exposed to the following:    Cellular systems in animals and plants and their effect on growth and function    Applications of biotechnology in animal and plant systems and their relevance to industry    The anatomy of domestic animals and internal systems which allow them to carry out biological functions    The main components and production systems of food products such as meat, milk and vegetables    Modern laboratory methods relevant to industry",
   "minimum_entry_requirements": "Entry 2023 Score the necessary CAO points and meet Leaving Certificate Minimum entry requirements  6 Subjects Subjects O6/H7 4 Subjects H5 2 Maths Grade 06/H7 English or Irish Grade O6/H7",
   "video": "https://youtu.be/8lAQJ8wvKnQ",
   "faculty_information_lecturer": "Dr Craig Murphy",
   "faculty_information__lecturer_image_url": "",
   "faculty_information__id": 12,
   "job_opportunities_and_salary_expectations": "Further Studies This course is an excellent platform for further studies, both in terms of short add-on courses, and more structured postgraduate degrees such as master of science and PhD programmes.  Graduates will also have obtained sufficient credits to teach Leaving Certificate Biology and Agricultural Science subjects at second level, pending the completion of an accredited postgraduate Professional Master of Education programme.  Graduates also meet the degree eligibility criteria for applications to postgraduate veterinary medicine programmes.  Career Opportunities Comprehensive training in biotechnology, microbiology, animal and plant sciences, health and disease, and quality systems will allow graduates to gain employment both nationally and internationally, as key players across a variety of sectors, including:    Veterinary disease diagnostics   Microbiology   Animal and plant genetics   Animal nutrition and feed production   Food development and production   Quality assurance and quality control   Animal and plant reproduction   Research and development",
   "clubs_and_societies": "https://societies.mtu.ie/",
   "course_reviews_and_testimonials": "",
   "map_info": "https://www.cit.ie/citcontacts.campus",
   "students_accomodation_link": "https://www.cit.ie/studentlife/accommodation/",
   "workshops": "https://societies.mtu.ie/"
 }
 {
   "college": "Munster Technological University",
   "course": "Interior Architecture - Cork Campus",
   "code": "MT760",
   "title": "Interior Architecture - Cork Campus",
   "course_type": "Undergradaute",
   "course_starts": "September",
   "fees": "  7,348.00",
   "level": "Level 7",
   "award": "BSc",
   "duration": "3 Years",
   "mode_of_study": "Full-time",
   "method_of_delivery": "Classroom",
   "commencement_date": "Sep-23",
   "location": "Cork",
   "thumbnail_image_url": "",
   "website_url": "https://www.cit.ie/course/MT880",
   "course_description": "Overview Interior architecture involves the design of interiors of buildings, their layout and space planning, fitting, technical and structural resolution, furnishing and decoration, and the preparation of all technical drawings and written documentation necessary for the carrying out of the work. The design work of interior architecture includes domestic, commercial, leisure, retail, educational, healthcare and cultural interior projects. Interior architectural design encompasses many types of interiors and utilises accompanying skills.  This course qualifies graduates to work in architectural and interior design firms, in junior management positions, and prepares the individual to choose self-employment after a suitable period of practical experience.  This mainly studio-based course is taught through formal lectures and tutorials. It has a significant amount of time allocated to studio and project work. There is appropriate technical input, supplementing the design drawing and presentation content.  This course examines contemporary practice in interior architecture and teaches you about our architectural heritage, how buildings work, and how to create high quality spatial experiences.  At MTU, interior architecture covers the spectrum of industry specialisms. It involves the initial design and plan for use to accommodate a changed purpose, or a significantly revised design for adaptive reuse of the building shell. It considers structural adaption, sustainable redevelopment strategies, use of light, air movement, ventilation, horizontal/vertical circulation, and servicing. The practice of interior architecture responds to multiple user needs and a wider social responsibility.",
   "course_content": "First Year at a Glance:   Interior Architecture Studio: introduction to simple spatial design; processes that are commonly used to organise and support study; research, analysis and studio design projects    Graphics: introduces you to the core of communication skills appropriate for a career in interior architecture; construction industry drawing conventions and techniques in order to clearly communicate design proposals    Technology & Materials: introduction to building technology; construction systems, components, and relevant building regulations principles    Architectural History & Design Theory: explores the foundations of western architecture examining the spatial, formal and structural components of key buildings and interior design",
   "minimum_entry_requirements": "Entry 2023 Score the necessary CAO points and meet Leaving Certificate Minimum entry requirements  5 Subjects Subjects O6/H7 5 Subjects H5 0 Maths Grade O6/H7 English or Irish Grade O6/H7",
   "video": "https://youtu.be/8lAQJ8wvKnQ",
   "faculty_information_lecturer": "Anne Rogers",
   "faculty_information__lecturer_image_url": "",
   "faculty_information__id": 13,
   "job_opportunities_and_salary_expectations": "Further Studies Subject to availability of places, suitably qualified graduates are eligible to apply for entry to year 4 (final year)    Bachelor of Science (Honours) in Interior Architecture  Career Opportunities This course qualifies graduates to work in architectural practice, interior architecture, and interior design firms, and allied disciplines in Architecture with a broad range of professional skills.  The graduate will be proficient in planning, spatial design and the materiality of interior schemes that involve multiple floors and mixed uses. The graduate is also oriented to commercial architectural practice with a strong understanding of sustainable design. The graduate will be able to develop designs and their attendant working drawings, and will deal with contractors, suppliers, and local authorities. The graduate may also select self employment after a suitable period of practical experience.    Private practice   Commercial   Government organisation   Local authority",
   "clubs_and_societies": "https://societies.mtu.ie/",
   "course_reviews_and_testimonials": "",
   "map_info": "https://www.cit.ie/citcontacts.campus",
   "students_accomodation_link": "https://www.cit.ie/studentlife/accommodation/",
   "workshops": "https://societies.mtu.ie/"
 }
 {
   "college": "University College Cork",
   "course": "CK202 Accounting (BSc (Hons)) ",
   "code": "CK202",
   "title": "Accounting (BSc (Hons)) ",
   "course_type": "Undergraduate",
   "course_starts": "September",
   "fees": "  3,138.00",
   "level": "Level 8",
   "award": "BSc (Hons)",
   "duration": "4 years",
   "mode_of_study": "Full Time",
   "method_of_delivery": "Face-to-Face",
   "commencement_date": "September",
   "location": "Cork",
   "thumbnail_image_url": "",
   "website_url": "https://www.ucc.ie/",
   "course_description": "The BSc Accounting is a distinctive broad business degree. It is unique in that it prepares students for a career in business and finance and for the pursuit of a professional accounting qualification, to further enhance career progression in business. Students have the opportunity to study a wide range of subjects including finance, law, management, economics, information systems, accounting, marketing and statistics.",
   "course_content": "Each year, students complete 12 modules amounting to 60 credits, except for third year where students are on paid work placement for semester 2.",
   "minimum_entry_requirements": "2 x H5, 4 x O6/H7; Maths, other language",
   "video": "",
   "faculty_information_lecturer": "Dr Peter Cleary",
   "faculty_information__lecturer_image_url": "https://www.youtube.com/watch?v=c6UfAWW2bC8",
   "faculty_information__id": 1,
   "job_opportunities_and_salary_expectations": "Over the course of the four-year programme students will learn how to prepare, understand, analyse and audit company financial statements. additionally, students will gain broad business skills as well as knowledge in the areas of finance, economics, information systems, law, management and marketing, and taxation. These skills are widely sought by employers in all areas of business.",
   "clubs_and_societies": "https://www.ucc.ie/en/societies/",
   "course_reviews_and_testimonials": "",
   "map_info": "",
   "students_accomodation_link": "https://www.ucc.ie/en/accommodation/campusaccommodation/",
   "workshops": "https://www.ucc.ie/en/skillscentre/sessions/"
 }
 {
   "college": "University College Cork",
   "course": "Anthropology (BA (Hons)) (CK123)",
   "code": "CK123",
   "title": "Anthropology",
   "course_type": "Undergraduate",
   "course_starts": "September",
   "fees": "  3,138.00",
   "level": "Level 8",
   "award": "BA (Hons)",
   "duration": "4 years",
   "mode_of_study": "Full Time",
   "method_of_delivery": "Face-to-Face",
   "commencement_date": "September",
   "location": "Cork",
   "thumbnail_image_url": "",
   "website_url": "https://www.ucc.ie/",
   "course_description": "Anthropology is the comparative study of humankind in the cultures of the world, both past and present and our BA (Hons) Anthropology degree at University College Cork brings together the many related disciplines to examine what defines us as humans and how we came to be the way we are. This exciting programme offers a unique way of looking at the world, offering a greater understanding of the human experience and a strong sense of global citizenship to meet the challenges of the future.",
   "course_content": "Our BA (Hons) Anthropology programme is a full-time, honours degree taken over three years. If you wish to spend a year abroad at one of our partner institutions in Europe and beyond, you can take the International Pathway option and spend Year 3 abroad before returning to UCC to complete your degree in Year 4.  Year 1 modules (60 credits total)  AR1001 The Archaeology of Ireland in Context (15 credits) AY1001  Introduction to Anthropology (5 credits) HI1007  Anti-Semitism in Europe from the Middle Ages to the Holocaust (5 credits) HI1012  Women in Europe since 1800 (5 credits) SC1005  Introduction to Sociology (5 credits) SC1006  Key Issues in Sociology (10 credits)  Plus one 15-credit module from the following:  FL1004  Irish Folklore & Culture: An Introduction (15 credits) or RG1001 Religions in the Contemporary World (15 credits)",
   "minimum_entry_requirements": "2 x H5, 4 x O6/H7; O6/H7 in another language.",
   "video": "",
   "faculty_information_lecturer": "Professor William O Brien",
   "faculty_information__lecturer_image_url": "https://www.youtube.com/watch?v=c6UfAWW2bC8",
   "faculty_information__id": 1,
   "job_opportunities_and_salary_expectations": "Study abroad: If you select the International Pathway in this degree, you will have the opportunity to spend Year 3 studying Anthropology at one of our numerous partner universities in Europe, North America, or Asia, before returning to UCC for Year 4 to complete your degree. See our Go Abroad with UCC page.  Work experience: There are a number of options for work experience both in the summer prior to and during your final year. There are also supported options through the CACSSS Professional Work Experience module (PX3001). This module offers preparatory training, a work placement organised by the UCC Careers Office, and post-placement follow-up.  You are also encouraged to seek summer employment in areas relevant to your studies, such as archaeological excavation, tourism and heritage, market research, and with State agencies working in public services and social policy, among others.",
   "clubs_and_societies": "https://www.ucc.ie/en/societies/",
   "course_reviews_and_testimonials": "",
   "map_info": "",
   "students_accomodation_link": "https://www.ucc.ie/en/accommodation/campusaccommodation/",
   "workshops": "https://www.ucc.ie/en/skillscentre/sessions/"
 }
 {
   "college": "University College Cork",
   "course": "Arts (BA (Hons)) CK101",
   "code": "CK101",
   "title": "Arts",
   "course_type": "Undergraduate",
   "course_starts": "September",
   "fees": "  3,138.00",
   "level": "Level 8",
   "award": "BA (Hons)",
   "duration": "4 years",
   "mode_of_study": "Full Time",
   "method_of_delivery": "Face-to-Face",
   "commencement_date": "September",
   "location": "Cork",
   "thumbnail_image_url": "",
   "website_url": "https://www.ucc.ie/",
   "course_description": "Our BA degree programme at University College Cork is the gateway to the immense and exciting possibilities of education. We offer a wide variety of subjects across diverse fields   this allows you the flexibility and opportunity to choose your career pathway or postgraduate route.  This programme gives you the space to explore your options. Ultimately you will not only excel in specific subject knowledge you will develop those intellectual, social and management skills essential for today s working environment.  Our Arts CK101 programme is a full-time three-year honours programme, based at the College of Arts, Celtic Studies & Social Sciences (CACSSS). If you wish to spend a year abroad at one of our partner institutions in Europe and beyond, you can apply to our four-year Arts (International) CK108 programme which is open to language and non-language students. ",
   "course_content": "Year 1 Modules  You will select four subjects from the following Subject Group Table, selecting no more than one from each group.  Group 1\tAsian Studies; Computer Science; History; Portuguese Group 2(a)*\tHistory of Art Group 2(b)*\tApplied Mathematics (Arts); European Studies; Folklore; Gaeilge/Irish; Greek & Roman Civilisation Group 3\tArchaeology; Chinese Studies; German; Latin; Mathematical Studies; Mathematics; Politics Group 4\tFrench; Sociology; Studies in Music Group 5\tB aloideas; Economics; English; Greek; Religions & Global Diversity Group 6(a)**\tGeography; Italian Group 6(b)**\tCeltic Civilisation; Philosophy; Spanish *Groups 2(a) and 2(b): Students can combine Group 2(b) History of Art with any subject from Group 2(a) in Year 1 only. Students can only study one subject from Groups 2(a) and 2(b) in Years 2 & 3.  **Groups 6(a) and 6(b): Students may not combine Italian with Celtic Civilisation or Philosophy in Year 2. Students may not combine Geography with Celtic Civilisation, Philosophy or Spanish in Year 2.  Please note: there are a number of first-year subjects in CK101 that are only available as minor subjects after the first year:  European Studies: European Studies is only available through Arts (International) CK108 after first year. Students who wish to keep on European Studies in second and subsequent years must apply to transfer to CK108 Arts International at the end of first year in CK101. Please contact the College Office for application. Music: Students who are interested in studying Music with another Arts subject, should apply to CK104 Arts - Music. Studies in Music through Arts CK101 is only available as a minor subject after first year and you will not be eligible to apply to transfer into the second year of CK104 from CK101 Arts. Please check Points to Note in the University Calendar (CK101) for a full list of subject entry requirements and subject-specific information.  ",
   "minimum_entry_requirements": "2 x H5, 4 x O6/H7; O6/H7 ",
   "video": "",
   "faculty_information_lecturer": "Professor William O Brien",
   "faculty_information__lecturer_image_url": "https://www.youtube.com/watch?v=c6UfAWW2bC10",
   "faculty_information__id": 1,
   "job_opportunities_and_salary_expectations": "The College of Arts, Celtic Studies and Social Science (CACSSS) offers an optional Professional Work Experience module (PX3001). This is an accredited professional work experience module that allows CACSSS students to explore and develop their career interests.",
   "clubs_and_societies": "https://www.ucc.ie/en/societies/",
   "course_reviews_and_testimonials": "",
   "map_info": "",
   "students_accomodation_link": "https://www.ucc.ie/en/accommodation/campusaccommodation/",
   "workshops": "https://www.ucc.ie/en/skillscentre/sessions/"
 }
 {
   "college": "University College Cork",
   "course": "Biochemistry (BSc (Hons)) (CK402)",
   "code": "CK402",
   "title": "Biochemistry",
   "course_type": "Undergraduate",
   "course_starts": "September",
   "fees": "  3,138.00",
   "level": "Level 8",
   "award": "(BSc (Hons)",
   "duration": "4 years",
   "mode_of_study": "Full Time",
   "method_of_delivery": "Face-to-Face",
   "commencement_date": "September",
   "location": "Cork",
   "thumbnail_image_url": "",
   "website_url": "https://www.ucc.ie/",
   "course_description": "BSc Biochemistry is the study of living organisms, particularly the human body, at cellular and sub-cellular levels and is an excellent stepping stone for entry into medicine, dentistry and pharmacy.",
   "course_content": "Students select one degree stream (depending on choice of Year 1 Electives) from:  Applied Plant Biology, Biochemistry, Biotechnology, Chemistry, Chemistry of Pharmaceutical Compounds, Chemistry with Forensic Sciences, Science Education (Chemistry or Biology Route), Microbiology, Neuroscience, Physiology  The subjects you will study from Year 2 onwards depend upon which programme you enter from the options above. Please see the individual course information pages for details of each of these programmes.",
   "minimum_entry_requirements": "3 x H5, 4 x O6/H7; O6/H7 ",
   "video": "",
   "faculty_information_lecturer": "Professor William O Brien",
   "faculty_information__lecturer_image_url": "https://www.youtube.com/watch?v=c6UfAWW2bC11",
   "faculty_information__id": 1,
   "job_opportunities_and_salary_expectations": "While there is no work placement incorporated into this course, the School of Biochemistry and Cell Biology facilitates you in finding summer laboratory work at the end of Year 3. In addition, in Year 4, each student carries out an independent research project in a biochemistry research laboratory, which our students find to be one of the highlights of the course.",
   "clubs_and_societies": "https://www.ucc.ie/en/societies/",
   "course_reviews_and_testimonials": "",
   "map_info": "",
   "students_accomodation_link": "https://www.ucc.ie/en/accommodation/campusaccommodation/",
   "workshops": "https://www.ucc.ie/en/skillscentre/sessions/"
 }
 {
   "college": "University College Cork",
   "course": "Biological & Chemical Sciences (BSc (Hons)) (CK402)",
   "code": "CK403",
   "title": "Biological & Chemical Sciences ",
   "course_type": "Undergraduate",
   "course_starts": "September",
   "fees": "  3,138.00",
   "level": "Level 8",
   "award": "(BSc (Hons)",
   "duration": "4 years",
   "mode_of_study": "Full Time",
   "method_of_delivery": "Face-to-Face",
   "commencement_date": "September",
   "location": "Cork",
   "thumbnail_image_url": "",
   "website_url": "https://www.ucc.ie/",
   "course_description": "BSc Biochemistry is the study of living organisms, particularly the human body, at cellular and sub-cellular levels and is an excellent stepping stone for entry into medicine, dentistry and pharmacy.",
   "course_content": "Students select one degree stream (depending on choice of Year 1 Electives) from:  Applied Plant Biology, Biochemistry, Biotechnology, Chemistry, Chemistry of Pharmaceutical Compounds, Chemistry with Forensic Sciences, Science Education (Chemistry or Biology Route), Microbiology, Neuroscience, Physiology  The subjects you will study from Year 2 onwards depend upon which programme you enter from the options above. Please see the individual course information pages for details of each of these programmes.",
   "minimum_entry_requirements": "4 x H5, 4 x O6/H7; O6/H7 ",
   "video": "",
   "faculty_information_lecturer": "Professor William O Brien",
   "faculty_information__lecturer_image_url": "https://www.youtube.com/watch?v=c6UfAWW2bC12",
   "faculty_information__id": 1,
   "job_opportunities_and_salary_expectations": "While there is no work placement incorporated into this course, the School of Biochemistry and Cell Biology facilitates you in finding summer laboratory work at the end of Year 3. In addition, in Year 4, each student carries out an independent research project in a biochemistry research laboratory, which our students find to be one of the highlights of the course.",
   "clubs_and_societies": "https://www.ucc.ie/en/societies/",
   "course_reviews_and_testimonials": "",
   "map_info": "",
   "students_accomodation_link": "https://www.ucc.ie/en/accommodation/campusaccommodation/",
   "workshops": "https://www.ucc.ie/en/skillscentre/sessions/"
 }
 {
   "college": "University College Cork",
   "course": "Business Information Systems (BSc (Hons)) (CK203)",
   "code": "CK203",
   "title": "Business Information Systems",
   "course_type": "Undergraduate",
   "course_starts": "September",
   "fees": "  3,138.00",
   "level": "Level 8",
   "award": "(BSc (Hons)",
   "duration": "4 years",
   "mode_of_study": "Full Time",
   "method_of_delivery": "Face-to-Face",
   "commencement_date": "September",
   "location": "Cork",
   "thumbnail_image_url": "",
   "website_url": "https://www.ucc.ie/",
   "course_description": "The BSc in Business Information Systems (BIS) specialises in the key skills that are essential to the success of professionals in modern information technology and information systems.  The goals of this four-year degree course are to:  educate: provide a worthwhile and memorable student experience; collaborate: join with business to ensure BIS students gain cutting edge skills in business and IT, while also linking with businesses to provide innovative IS-related expertise; innovate: cultivate and apply expertise in teaching, research and development. Our BIS Advisory Board, comprising a number of the most senior Irish business executives, is there to advise and ensure UCC BIS courses are world-class, relevant, and attractive to businesses nationally and internationally.",
   "course_content": "Year 1 Modules  Starting with introductory business and IT modules, the first half of Year 1 is designed to ensure all students are equally skilled to successfully complete the course.  Core  IS1108 Information Systems in Global Organisations (5 credits) IS1109 Business Systems Analysis and Design (5 credits) AC1113 Principles of Accounting (5 credits) EC1212 Economics of Business 1 (5 credits) IS1110 Foundations of Programming for Information Systems 1 (5 credits) IS1111 Foundations of Programming for Information Systems 2 (5 credits) ST1023 Introduction to Business Statistics (5 credits) IS1112 Principles of Information Technology (5 credits) IS1113 Web Development (5 credits) IS1115 Personal Development and Ethics for IS Professionals 1 (5 credits) AC1114 Introduction to Management Accounting (5 credits) Electives  MG1004 Introduction to Management and Organisation (5 credits) MG1003 Introduction to Marketing (5 credits) Year 2 Modules  Modules follow on from Year 1 (with choices available) but are taught at an advanced level, with the purpose of preparing you for work experience in Year 3.  Core  Advanced Systems Analysis and Design 1, Intermediate Management Accounting 1, Advanced Systems Analysis and Design 2, Database Design and Development 1, Business Microeconomics 1, Database Design and Development 2, Intermediate Programming for Information Systems 1, Design Thinking and Visual Prototyping, Intermediate Programming for Information Systems 2, Personal Development and Ethics for IS Professionals 2  Electives  Investment Appraisal; Introduction to Food Supply Chain Management; People and Organisation; Enterprise Planning and Processes; Market Research; Consumer Behaviour and Sustainable Consumption; Business Ethics and Governance  Year 3 Modules  This is the shortest in academic terms. Examinations take place in February, after which you will spend six months on a paid business internship.  Networking and Cloud Computing for Global Organisations; Advanced Programming for Information Systems; DevOps Processes and Tools; Organisational Data Analysis and Visualisation; Personal Development and Ethics for IS Professionals 3; Database Management and Applications; Economics of Information  Year 4 Modules  Core  Personal Development and Ethics for IS Professionals 4; Research Project in Information Systems; Information Systems Strategy for Global Organisations; Information Systems Management; Innovation and Information Technology Industry Trends",
   "minimum_entry_requirements": "5 x H5, 4 x O6/H7; O6/H7 ",
   "video": "",
   "faculty_information_lecturer": "Professor William O Brien",
   "faculty_information__lecturer_image_url": "https://www.youtube.com/watch?v=c6UfAWW2bC13",
   "faculty_information__id": 1,
   "job_opportunities_and_salary_expectations": "BIS students undertake paid placement with major multinationals and innovative start-ups in New York, Boston, London, Edinburgh, Dublin, Cork, and elsewhere, in the financial services, technology, business consulting, medical, and other industry sectors.",
   "clubs_and_societies": "https://www.ucc.ie/en/societies/",
   "course_reviews_and_testimonials": "",
   "map_info": "",
   "students_accomodation_link": "https://www.ucc.ie/en/accommodation/campusaccommodation/",
   "workshops": "https://www.ucc.ie/en/skillscentre/sessions/"
 }
 {
   "college": "University College Cork",
   "course": "Chemical Physics (BSc (Hons)) (CK406)",
   "code": "CK406",
   "title": "Chemical Physics",
   "course_type": "Undergraduate",
   "course_starts": "September",
   "fees": "  3,138.00",
   "level": "Level 8",
   "award": "(BSc (Hons)",
   "duration": "4 years",
   "mode_of_study": "Full Time",
   "method_of_delivery": "Face-to-Face",
   "commencement_date": "September",
   "location": "Cork",
   "thumbnail_image_url": "",
   "website_url": "https://www.ucc.ie/",
   "course_description": "Chemical Physics sits at the intersection of chemistry and physics. It aims to understand the structure, energies and transformations of matter and its dynamics at a molecular level.  Our BSc Chemical Physics degree provides a solid grounding in both physics and chemistry and is ideally suited to students who are curious about how and why the world works at a molecular level. With a broad education in the physical sciences, highly developed problem-solving and analytical skills, and extensive training in experimental methods, graduates of Chemical Physics may be assured of excellent employment prospects in industry, government, research and teaching.  The BSc in Chemical Physics at UCC is internationally accredited by the Institute of Physics.  Entrance to the BSc Chemical Physics degree is via Physics and Astrophysics or Chemical Sciences.",
   "course_content": "Year 1 Modules: Refer to CK406 and CK408. Year 2 Core Modules: Computational Physics; Electrostatics and Magnetostatics; Energetics and Kinetics; Experimental Methods; Fourier Methods; Main Group and Transition Element Chemistry; Quantum Physics; Spectroscopy; Structure, Bonding and Quantum Mechanics; Thermodynamics and Statistical Physics; Calculus. Electives: States of Matter; Organic Chemistry for Environmental Scientists. Year 3 Modules: C/C++ Programming with Applications; Computer Modelling and Numerical Techniques; Condensed Matter Physics; Electromagnetism; Environmental Chemistry and Analysis; Experimental Methods; Materials Chemistry; Optics; Physical Chemistry; Quantum Mechanics; Scientific Communication and Information Literacy Skills. Year 4 Core Modules: Chemical Physics; Advanced Chemistry Research Project; Advanced Physics Research Project. Electives: Lasers, Photochemistry and Spectroscopy; Interfaces, Microscopy and Modelling; Advanced Nano Materials; Atmospheric Chemistry and Air Pollution; Advanced Quantum Mechanics; Advanced Electromagnetism; Advanced Condensed Matter Physics; Introduction to Lasers and Photonics; Physics of Semiconductor Devices.",
   "minimum_entry_requirements": "6 x H5, 4 x O6/H7; O6/H7 ",
   "video": "",
   "faculty_information_lecturer": "Professor William O Brien",
   "faculty_information__lecturer_image_url": "https://www.youtube.com/watch?v=c6UfAWW2bC14",
   "faculty_information__id": 1,
   "job_opportunities_and_salary_expectations": "There are possibilities of summer projects in the Department of Physics. The department is an active participant in undergraduate student-exchange programmes with numerous partner universities across Europe.",
   "clubs_and_societies": "https://www.ucc.ie/en/societies/",
   "course_reviews_and_testimonials": "",
   "map_info": "",
   "students_accomodation_link": "https://www.ucc.ie/en/accommodation/campusaccommodation/",
   "workshops": "https://www.ucc.ie/en/skillscentre/sessions/"
 }
 {
   "college": "University College Cork",
   "course": "Commerce (BComm (Hons)) (CK201)",
   "code": "CK201",
   "title": "Commerce",
   "course_type": "Undergraduate",
   "course_starts": "September",
   "fees": "  3,138.00",
   "level": "Level 8",
   "award": "BComm (Hons)",
   "duration": "4 years",
   "mode_of_study": "Full Time",
   "method_of_delivery": "Face-to-Face",
   "commencement_date": "September",
   "location": "Cork",
   "thumbnail_image_url": "",
   "website_url": "https://www.ucc.ie/",
   "course_description": "The Bachelor of Commerce Degree programme is the leading undergraduate business degree in Ireland.  It is designed for motivated students who intend on making a future impact on the business world. This highly innovative degree offers a comprehensive range of 5 employment led thematic majors in the fourth year:  Banking and Financial Markets Human Resources and Leadership Business Development and Consultancy Marketing and Consumer Understanding Operations and Supply Chains",
   "course_content": "Year 1 Modules (all 5 credits)  AC1100 Introduction to Accounting BU1000 Developing Critical Thinking Skills EC1207 Principles of the Micro Economy EC1208 Principles of the Macro Economy FE1101 Introduction to Food Business and Development IS1105 Business Information Systems LW1108 Introduction to the Legal System LW1109 Introduction to Business Law MA1100 Introductory Mathematics for Business I MG1000 Foundations of Management and Organisational Behaviour MG1002 Foundations of Marketing ST1023 Introduction to Business Statistics Year 2 Modules  In Year 2 students take a combination of compulsory modules and electives. The electives allow students to begin to specialise in fields that interest them the most.  The compulsory modules include Introduction to Management Accounting; Intermediate Management Accounting; Placement Skills and Professional Practice; Economics of Managerial Decision Making; Economics - Production and Costs; IS Analysis and Design for Business; People and Organisation; International Business; Enterprise Planning and Processes; Business Ethics.  The elective modules include Sustainability in Modern Businesses; Global Food Policy; International Politics; European Government and Politics; Commercial Law; Introductory Mathematics for Business; Consumer Behaviour and Sustainable Consumption; Methods of Business Statistics.  Year 3 Modules  In Year 3 student select one of the following options:  Study at an approved university abroad for the full academic year; Study at an approved university abroad for semester 1, return to UCC for semester 2, then complete either a 6-month work placement or a research project; Study in UCC for semesters 1 and 2, then complete either a 6-month work placement or a research project. In this year students gain an intermediate knowledge of possible thematic majors which are available in the fourth year.  In addition to taking these core modules students select a range of minor subjects from the following subject areas: Accounting, Business Economics; Food Business & Development; Law; Management; Marketing, Maths, Statistics  Year 4 Modules  In year 4 students take 40 credits from their selected thematic major including:  Business and Financial markets Human Resources and Leadership Innovation, Entrepreneurship and Strategy Markets and Consumer understanding Operations and Supply Chains",
   "minimum_entry_requirements": "7 x H5, 4 x O6/H7; O6/H7 ",
   "video": "",
   "faculty_information_lecturer": "Professor William O Brien",
   "faculty_information__lecturer_image_url": "https://www.youtube.com/watch?v=c6UfAWW2bC15",
   "faculty_information__id": 1,
   "job_opportunities_and_salary_expectations": "A degree is not just about what you know - it's also about what you can do. We know employers want graduates with both business knowledge and practical skills to hit the ground running. This degree will prepare you to graduate career-ready by building these business skills and providing real workplace learning experiences.  In year 3 you will have the opportunity to take the transferable skills module and a limited number of students may study abroad. Every year up to 170 students take internships with leading employers across many industry areas nationwide and overseas, including accounting firms, banking and finance, food and drinks, telecoms, pharmaceutical and healthcare, retail and distribution and the public sector. Many of the firms hire their internship students as graduates. Most internships are in Ireland, but some are abroad.  A number of our students choose to compete to study abroad in our partner business schools in the US, Canada, Europe and Singapore. Some students spend the first semester abroad and return home in time to complete the work placement programme. Other students spend the full academic year abroad, with many of these arranging their own summer internships in the US and Ireland.",
   "clubs_and_societies": "https://www.ucc.ie/en/societies/",
   "course_reviews_and_testimonials": "",
   "map_info": "",
   "students_accomodation_link": "https://www.ucc.ie/en/accommodation/campusaccommodation/",
   "workshops": "https://www.ucc.ie/en/skillscentre/sessions/"
 }
 {
   "college": "University College Cork",
   "course": "Computer Science (BSc (Hons)) (CK401)",
   "code": "CK401",
   "title": "Computer Science",
   "course_type": "Undergraduate",
   "course_starts": "September",
   "fees": "  3,138.00",
   "level": "Level 8",
   "award": "(BSc (Hons)",
   "duration": "4 years",
   "mode_of_study": "Full Time",
   "method_of_delivery": "Face-to-Face",
   "commencement_date": "September",
   "location": "Cork",
   "thumbnail_image_url": "",
   "website_url": "https://www.ucc.ie/",
   "course_description": "Graduates of Computer Science at UCC understand how computer-based systems work and how we can harness their potential to develop sophisticated computer applications upon which our modern world depends. The BSc in Computer Science is a full-time four-year degree course that encompasses all aspects of computer systems (both software and hardware) and ICT (information and communication technology), including software development, database technology, computer networks, operating systems, algorithms, security, web technology and applications.",
   "course_content": "Year 1  CORE:  CS1106 Introduction to Relational Databases CS1110 Computer Hardware Organisation CS1111 Systems Organisation CS1112 Foundations of Computer Science I CS1113 Foundations of Computer Science II CS1115 Web Development I CS1116 Web Development II CS1117 Introduction to Programming (15 credits) ELECTIVES:  If you are a proficient or native speaker it is not recommended that this language be taken as an elective.  CS1130 & CS1131 Irish Language for Computer Science I & II   CH1001 Chinese Language (Mandarin) I (Beginner Level) (10 credits)  EC1202 Economic Reasoning for Business & EC1203 Macroeconomic Context and Business  FR0105 Introduction to French & FR1005 French for Near Beginners  OR FR1105 Threshold French & FR1107 French for Reading Purposes I  GE0005 & GE0008 German Language (CEFR-Level A2.1 & A2.2)  HS0028 Spanish Language (Beginner Level) (10 credits)  IT1102 Non-Beginners  Written and Spoken Italian (10 credits) OR IT1109 Introduction to Written and Spoken Italian (10 credits)  MA1001 & MA1002 Calculus for Science Parts 1 & 2 OR MA1059 Calculus, MA1060 Introduction to Analysis  Year 2  CORE:  CS2208 Information Storage and Management I  CS2209 Information Storage and Management II  CS2503 Operating Systems I  CS2505 Network Computing  CS2506 Operating Systems II  CS2507 Computer Architecture CS2513 Intermediate Programming  CS2514 Introduction to Java  CS2515 Algorithms and Data Structures I CS2516 Algorithms and Data Structures II ELECTIVES: Computer Science options; Language options; Mathematics.  Year 3  CORE:  CS3305 Team Software Project (10 credits) CS3306 Workplace Technology and Skills (10 credits)  CS3318 Advanced Programming with Java  CS3500 Software Engineering  Electives:  Students also take 20 credits worth of computer science electives  Work placement: 6 months (March to September) or 12 months (from March)  Year 4  CORE:  CS4501 Computer Science Project (15 credits) Electives:  Students also take 20 credits worth of computer science electives  BSc SINGLE HONOURS COMPUTER SCIENCE (SOFTWARE ENTREPRENEURSHIP)  From year two, students can choose the Software Entrepreneurship stream.  Year 2 Modules  (25 Computer Science; 35 Economics)  Year 3 Modules  (40 Computer Science; 20 Economics)  CORE: Work Placement: 6 months (March to September) or 12 months (from March)  Year 4 Modules  (35 Computer Science; 25 Economics)  See the College Calendar for additional information on the Programme and the Book of Modules for further details on modules.",
   "minimum_entry_requirements": "7 x H5, 4 x O6/H7; O6/H7 ",
   "video": "",
   "faculty_information_lecturer": "Professor William O Brien",
   "faculty_information__lecturer_image_url": "https://www.youtube.com/watch?v=c6UfAWW2bC15",
   "faculty_information__id": 1,
   "job_opportunities_and_salary_expectations": "The technology sector in Ireland directly employs over 105,000 people, with 75% employed in multinational companies and the remainder in the indigenous digital technology sector.  In 2017 92% of graduates from the BSc (Hons) Computer Science surveyed were in employment while a further 6% went on to further study or training. Employers taking people on from this cohort of graduates included Dell EMC, Google, Amazon Web Services, Johnson Controls, McAfee, Teamwork, McKesson, Stryker, and many more.",
   "clubs_and_societies": "https://www.ucc.ie/en/societies/",
   "course_reviews_and_testimonials": "",
   "map_info": "",
   "students_accomodation_link": "https://www.ucc.ie/en/accommodation/campusaccommodation/",
   "workshops": "https://www.ucc.ie/en/skillscentre/sessions/"
 }
 {
   "college": "University College Cork",
   "course": "Data Science & Analytics (BSc (Hons)) (CK 411)",
   "code": "CK 411",
   "title": "Data Science & Analytics",
   "course_type": "Undergraduate",
   "course_starts": "September",
   "fees": "  3,138.00",
   "level": "Level 8",
   "award": "(BSc (Hons)",
   "duration": "4 years",
   "mode_of_study": "Full Time",
   "method_of_delivery": "Face-to-Face",
   "commencement_date": "September",
   "location": "Cork",
   "thumbnail_image_url": "",
   "website_url": "https://www.ucc.ie/",
   "course_description": "Data Science & Analytics focuses on new ways to capture and understand data from the world around us. It helps us make better decisions for people, communities and industry.  Our BSc in Data Science & Analytics degree at UCC provides education in data storage, manipulation and interpretation using mathematical sciences and computational methods which assists us in solving complex real-world problems. In the first and second year, you will study the mathematical and computational foundations of data science and analytics. During the third year, you begin applying the fundamentals of data science and analytics to real-life problems and data. In the Spring of third year, you undertake a six-month work placement (paid in most cases) providing an opportunity to apply the knowledge you have learned in a workplace environment. In the fourth year, you choose specialised modules and undertake an independent project, which enables you to investigate more applied elements of the discipline. Firms specialising in analytics, financial services and consulting, and governmental agencies to name but a few are currently seeking graduates with data analytics skills to fill a range of positions.",
   "course_content": "Year 1 Modules  All modules 5 credits unless otherwise stated.  CS1106 Introduction to Relational Databases CS1112 Foundations of Computer Science I CS1113 Foundations of Computer Science II  CS1117 Introduction to Programming (15 credits) AM1054 Mathematical Software  MA1058 Introduction to Linear Algebra MA1059 Calculus  ST1050 Statistical Programming in R ST1051 Introduction to Probability and Statistics Plus 5 credits from the following:  Electives  AM1053 Introduction to Mathematical Modelling ST1401 Introduction to Operations Research Year 2 (Core)  CS2208 Information Storage and Management I  CS2209 Information Storage and Management II  CS2513 Intermediate Programming CS2514 Introduction to Java  CS2515 Algorithms and Data Structures I CS2516 Algorithms and Data Structures II  MA2055 Linear Algebra  MA2071 Multivariable Calculus ST2053 Introduction to Regression Analysis ST2054 Probability and Mathematical Statistics (10 credits) Electives  AM2052 Mathematical Modelling ST2402 Modelling and Systems for Decision Making  Year 3   CS3204 Cloud Infrastructure and Services CS3205 Data Visualization for Analytics Applications  CS3220 Work Placement DSA (10 credits)  CS3306 Workplace Technology and Skills (10 credits) CS3318 Advanced Programming with Java  CS3509 Theory of Computation  ST3053 Stochastic Modelling I  ST3061 Statistical Theory of Estimation  ST3069 Generalised Linear Models  ST3070 Statistical Theory of Hypothesis Testing  plus Work placement: 6 months (March to September) or 12 months (from March) Year 4   CS4701 Analytics Project for Computer Science (15 credits) or ST4092 Data Analytics Project (15 credits) and  CS4704 Algorithms and Data Structures for Analytics CS4705 Computational Machine Learning  ST4060 Statistical Methods for Machine Learning I ST4061 Statistical Methods for Machine Learning II ST4069 Multivariate Methods for Data Analysis (10 credits)",
   "minimum_entry_requirements": "7 x H5, 4 x O6/H7; O6/H7 ",
   "video": "",
   "faculty_information_lecturer": "Professor William O Brien",
   "faculty_information__lecturer_image_url": "https://www.youtube.com/watch?v=c6UfAWW2bC15",
   "faculty_information__id": 1,
   "job_opportunities_and_salary_expectations": "The World Economic Forum predicts that by 2022, data scientists and analysts will become the number one emerging role in the world. Data science experts are needed in virtually every job sector, not just technology. In the US, the average data scientist salary is US$113,000, according to Glassdoor. (World Economic Forum 2020)  Practically all sectors of the economy employ Data Scientists.  The following list provides some insight into sectors/companies that use such skills:  Banking e.g. AIB, BoI, Central Bank, Citi Energy e.g. Bord Gas, Electric Ireland Financial Services e.g. Elavon, Pramerica Food & Agriculture e.g. Kerry, Glanbia Gaming e.g. Paddy Power, Xanadu, Betbright Government e.g. CSO, Revenue, HSE Health e.g. HSE, HIQA, Optum Insurance e.g. Allianz, Aviva, Aon Management Consultancy e.g. EY, PWC, FTI Consulting, Deloitte, Accenture, Clarion, KPMG Marketing, Media & Communication e.g. Core Media, Vodafone, Eir, 3 Pharmaceutical e.g. Abbott, Novartis, Regeneron, Johnson and Johnson, Pfizer Research e.g. ESRI, Universities, Insight Retail e.g. Dunnes Stores, Tesco, Super Valu, Amazon, Wayfair Software e.g. SAS, SPSS Sport e.g. Munster Rugby, GAA, RTE, Sky Sports Technology e.g. IBM, EMC, HP, Apple, Microsoft, Google, Dell, Facebook, Intel, Version 1 ",
   "clubs_and_societies": "https://www.ucc.ie/en/societies/",
   "course_reviews_and_testimonials": "",
   "map_info": "",
   "students_accomodation_link": "https://www.ucc.ie/en/accommodation/campusaccommodation/",
   "workshops": "https://www.ucc.ie/en/skillscentre/sessions/"
 }